[{"url": "/wiki/Richard_Shelby", "last_name": "Shelby", "name": "Richard Shelby", "biography": "Richard Craig \"Dick\" Shelby (born May 6, 1934) is the senior United States Senator from Alabama. First elected to the Senate in 1986, he is the Chairman of the Senate Committee on Rules and Administration. He also serves on the Senate Appropriations Committee and the U.S. Senate Committee on Banking, Housing, and Urban Affairs. Born in Birmingham, Alabama, Shelby received his law degree from the Birmingham School of Law in Birmingham, Alabama, in 1961. After law school in 1963, he went on to serve as city prosecutor (1963-1971). During this period he worked as a U.S. Magistrate for the Northern District of Alabama (1966-1970) and Special Assistant Attorney General of Alabama (1969-1971). He won a seat in the Alabama Senate in 1970. In 1978, he was elected from the 7th District to the United States House of Representatives, where he was among a group of Conservative Democrats known as the boll weevils. In 1986, Shelby won a tight race as a Democrat for the U.S. Senate. Partway through his second term, he switched to the Republican Party in 1994, the day after the Republican Revolution in which they gained the majority in Congress in midterm elections midway through President Bill Clinton's first term. Shelby was re-elected by a large margin in 1998 and has faced no significant electoral opposition since. He is currently the dean of the Alabama delegation.", "id": "S000320"}, {"url": "/wiki/Luther_Strange", "last_name": "Strange", "name": "Luther Strange", "biography": "Luther Johnson Strange III (born March 1, 1953) is an American attorney and politician, who is currently serving as the Junior Senator from the state of Alabama. He previously served as the 47th Attorney General of the U.S. state of Alabama from 2011 until 2017. Strange was a candidate for public office in both 2006 and 2010. In 2006, Strange ran for Lieutenant Governor of Alabama and defeated George Wallace, Jr. in the Republican primary. Strange then lost the general election to Democrat Jim Folsom, Jr. In 2010, Strange defeated incumbent Attorney General Troy King in the Republican primary, before going on to win the general election on November 2, 2010, against Democrat James Anderson. On December 6, 2016, Strange announced his candidacy for the seat held by Jeff Sessions, representing Alabama in the United States Senate, after then-President-Elect Donald Trump had announced on November 18, 2016, that he would be nominating Sessions to the office of Attorney General of the United States. Strange was appointed as Senator on February 9, 2017, by Alabama governor Robert J. Bentley to fill out the vacancy caused by Sessions' resignation.", "id": "S001202"}, {"url": "/wiki/Lisa_Murkowski", "last_name": "Murkowski", "name": "Lisa Murkowski", "biography": "Lisa Ann Murkowski (born May 22, 1957) is the senior United States Senator from Alaska and a member of the Republican Party. She has served in the Senate since 2002. Murkowski became the state's senior senator on January 3, 2009, when Democrat Mark Begich, who had defeated Alaska's senior senator Ted Stevens in November 2008, took office. She is the daughter of former U.S. Senator and Governor of Alaska Frank Murkowski. Before her appointment to the Senate, she served in the Alaska House of Representatives and was eventually elected majority leader. Murkowski was appointed to the U.S. Senate by her father, Frank Murkowski, who resigned his seat in December 2002 to become the Governor of Alaska. She completed her father's unexpired term, which ended in January 2005. She ran for and won a full term in 2004. She ran for a second term in 2010. She lost the Republican Party nomination to Tea Party candidate Joe Miller. She then ran as a write-in candidate and defeated both Miller and Democrat Scott McAdams in the general election, making her only the second senator to be elected by write-in vote since Strom Thurmond in 1954. Although Sen. Murkowski has won three full terms to the Senate, she has never won a majority of the vote winning pluralities each time: 48.5% in 2004, 39.5% in 2010 and 44% in 2016.", "id": "M001153"}, {"url": "/wiki/Dan_Sullivan_(U.S._Senator)", "last_name": "Sullivan", "name": "Dan Sullivan", "biography": "Daniel Scott \"Dan\" Sullivan (born November 13, 1964) is an American politician and member of the Republican Party who has served as the junior United States Senator from Alaska since January 2015. Born in Ohio, Sullivan earned degrees from Harvard University and Georgetown University, interning at the United States Court of Appeals for the District of Columbia Circuit. After graduating in 1993, he joined the United States Marine Corps, leaving active duty in 1997. He has since served in the United States Marine Corps Reserve and was recalled to active duty from 2004 to 2006 and in 2009 and 2013. Between 1997 and 1999, he clerked for judges on the United States Court of Appeals for the Ninth Circuit and the Alaska Supreme Court. He worked in private practice in Anchorage, Alaska from 2000 to 2002, then moved to Maryland to work for the federal government, first with the National Economic Council and National Security Council, then as Assistant Secretary of State for Economic and Business Affairs. Sullivan then returned to Alaska, serving first as Alaska Attorney General from 2009 to 2010, then as Commissioner of the Alaska Department of Natural Resources from 2010 to 2013. He resigned from office in September of that year to run for the United States Senate seat held by Democrat Mark Begich in the 2014 election. In August 2014, Sullivan won the Republican primary, defeating Alaska Lieutenant Governor Mead Treadwell and 2010 Senate nominee Joe Miller. After a close race, he defeated Begich in the general election by 47.96% to 45.83%, a margin of 6,014 votes out of 282,400 cast.", "id": "S001198"}, {"url": "/wiki/John_McCain", "last_name": "McCain", "name": "John McCain", "biography": "This article is part of a series about John McCain", "id": "M000303"}, {"url": "/wiki/Jeff_Flake", "last_name": "Flake", "name": "Jeff Flake", "biography": "Jeffry Lane \"Jeff\" Flake (born December 31, 1962) is an American politician and member of the Republican Party who has served as the Junior United States Senator from Arizona since 2013. Born in Snowflake, Arizona, Flake is a graduate of Brigham Young University and was a Mormon missionary for the Church of Jesus Christ of Latter-day Saints before working in public affairs, serving as Executive Director of the Foundation for Democracy in Namibia and Executive Director of the Goldwater Institute. Flake was elected to the United States House of Representatives from Arizona in 2000 for the state's Arizona's 1st congressional district. He was redistricted to the Arizona's 6th congressional district during his first term and was re-elected six times, serving from 2001 to 2013 and assigned to the Committee on Appropriations. Flake declined to seek re-election to the House in 2012, instead running for the U.S. Senate. He defeated three challengers in the Republican primary and, after a close race, beat Democrat Richard Carmona, the former Surgeon General of the United States, in the general election by 49.2% to 46.2%. Flake was sworn-in in January 2013 and serves on the Committee on Energy and Natural Resources, the Committee on Foreign Relations, the Committee on the Judiciary and the Special Committee on Aging.", "id": "F000444"}, {"url": "/wiki/John_Boozman", "last_name": "Boozman", "name": "John Boozman", "biography": "John Nichols Boozman (born December 10, 1950) is the senior United States Senator for Arkansas, and a member of the Republican Party. He served as the United States Representative for Arkansas's 3rd congressional district from 2001 to 2011. Born in Shreveport, Louisiana, he is the brother of the late state Senator Fay Boozman. He attended the University of Arkansas, where he played football for the Arkansas Razorbacks, and graduated from the Southern College of Optometry. He co-founded a private optometry clinic in 1977 and worked as a volunteer optometrist for low-income families. He won a special election in 2002 to the U.S. House of Representatives, where he served as assistant majority whip and sat on the Republican Policy Committee. He was an advocate for drug policy issues and chaired the Veteran Affairs Economic Opportunity Subcommittee, where he led the passage of bills expanding services for unemployed veterans. Boozman was elected to the United States Senate in 2010, defeating Democratic incumbent Blanche Lincoln by a 21-point margin and becoming the first Republican to be elected to the seat since Reconstruction. He took office in January 2011 and is the ranking Republican on the Senate Agriculture Subcommittee on Conservation, Forestry and Natural Resources, the Commerce Subcommittee on Science and Space and the Environment and Public Works Subcommittee on Green Jobs and the New Economy. Boozman became the senior Senator in 2015 when Mark Pryor left the Senate after his defeat, and won re-election in 2016.", "id": "B001236"}, {"url": "/wiki/Tom_Cotton", "last_name": "Cotton", "name": "Tom Cotton", "biography": "Thomas Bryant \"Tom\" Cotton (born May 13, 1977) is an American politician who is the junior United States Senator from Arkansas. A member of the Republican Party, Cotton has served in the Senate since January 3, 2015. At age 39, he is currently the youngest U.S. Senator. Cotton was first elected to the Senate in 2014, defeating two-term Democratic incumbent Mark Pryor. He previously served one term in the United States House of Representatives from 2013 until 2015.", "id": "C001095"}, {"url": "/wiki/Dianne_Feinstein", "last_name": "Feinstein", "name": "Dianne Feinstein", "biography": "Dianne Goldman Berman Feinstein (born Dianne Emiel Goldman ; June 22, 1933) is the senior United States Senator from California. A member of the Democratic Party, she has served in the Senate since 1992. She also served as the 38th Mayor of San Francisco from 1978 to 1988. Born in San Francisco, Feinstein graduated from Stanford University in 1955 with a B.A. in history. In the 1960s she worked in city government, and in 1970 she was elected to the San Francisco Board of Supervisors. She served as the board's first female president in 1978, during which time the assassinations of Mayor George Moscone and City Supervisor Harvey Milk drew national attention to the city. Feinstein succeeded Moscone as mayor. During her tenure as San Francisco's first female mayor she led a revamp of the city's cable car system and oversaw the 1984 Democratic National Convention. After a failed gubernatorial campaign in 1990, she won a 1992 special election to the U.S. Senate. Feinstein was first elected on the same ballot as her peer Barbara Boxer, and the two became California's first female U.S. Senators. Feinstein has been re-elected four times since then and in the 2012 election, she claimed the record for the most popular votes in any U.S. Senate election in history, having received 7.75 million votes. Feinstein was the author of the 1994 Federal Assault Weapons Ban which expired in 2004. In 2013 she introduced a new assault weapons bill, which failed to pass. Feinstein formerly chaired the Senate Rules Committee (2007-09) and chaired the Select Committee on Intelligence from 2009 to 2015, when the Democrats lost control of the Senate. She is the only woman to have presided over a U.S. presidential inauguration. At the age of 83, Feinstein is the oldest currently serving United States Senator.", "id": "F000062"}, {"url": "/wiki/Kamala_Harris", "last_name": "Harris", "name": "Kamala Harris", "biography": "Kamala Devi Harris (born October 20, 1964) is an American attorney and politician who is the junior United States Senator from California. She is a member of the Democratic Party and served as the 32nd Attorney General of California. Harris graduated from Howard University and University of California, Hastings College of the Law. She worked as a Deputy District Attorney in Alameda County, California (1990-98). She served as Managing Attorney of the Career Criminal Unit in the San Francisco District Attorney's Office (1998-2000) and as Chief of the Community and Neighborhood Division in the office of San Francisco City Attorney (2000-03). In 2003, she was elected District Attorney of San Francisco, defeating incumbent Terence Hallinan. She was re-elected in 2007 and served from 2004 to 2011. Harris was elected California's Attorney General in 2010 and re-elected in 2014. Harris was the first woman, the first Jamaican American, the first Asian American and the first Indian American attorney general in California. On November 8, 2016, she defeated Loretta Sanchez in the 2016 U.S. Senate election to replace outgoing Democratic senator Barbara Boxer, becoming the second woman of color, first Indian American, and first biracial woman elected to serve in the United States Senate.", "id": "H001075"}, {"url": "/wiki/Michael_Bennet", "last_name": "Bennet", "name": "Michael Bennet", "biography": "Michael Farrand Bennet (born November 28, 1964) is an American businessman, lawyer, and Democratic politician. He is the senior United States Senator from Colorado. He became a senator when Ken Salazar was appointed Secretary of the Interior. Bennet previously worked as managing director for the Anschutz Investment Company, chief of staff to then- Denver mayor (and current Colorado Governor) John Hickenlooper, and superintendent of Denver Public Schools. Bennet is the son of Douglas J. Bennet, a former State Department official and president of Wesleyan University. Early in his career, Bennet worked for Ohio Governor Richard Celeste. He went on to receive his J.D. degree, after which he worked as a law clerk and later as Counsel to the U.S. Deputy Attorney General in the Clinton administration. Bennet became superintendent of the Denver public school system in July 2005. Bennet was speculated in late 2008 as a candidate for Obama's United States Secretary of Education. He was appointed by Governor Bill Ritter to fill the U.S. Senate seat vacated by Ken Salazar when Salazar became Secretary of the Interior in January 2009. Bennet was elected in the 2010 Senate election where he defeated Republican Ken Buck. Bennet served as chair of the Democratic Senatorial Campaign Committee (DSCC) for the 2014 elections. He was re-elected to a second term in 2016.", "id": "B001267"}, {"url": "/wiki/Cory_Gardner", "last_name": "Gardner", "name": "Cory Gardner", "biography": "Cory Scott Gardner (born August 22, 1974) is an American politician who is the junior United States Senator from Colorado. He is a Republican and was previously the U.S. Representative for Colorado's 4th congressional district. Prior to that, he was a member of the Colorado House of Representatives. Gardner announced his candidacy for the U.S. Senate in March 2014, quickly clearing the Republican primary field, and defeated Democratic incumbent Mark Udall in the November 2014 race.", "id": "G000562"}, {"url": "/wiki/Richard_Blumenthal", "last_name": "Blumenthal", "name": "Richard Blumenthal", "biography": "Richard \" Dick \" Blumenthal (born February 13, 1946) is the senior United States Senator from Connecticut, in office since 2011. Previously, he served as Attorney General of Connecticut from 1991 to 2011. He is a member of the Democratic Party. Born in Brooklyn, New York, Blumenthal attended Riverdale Country School, a private school in the Bronx. Blumenthal is a graduate of Harvard College, where he was editorial chairman of The Harvard Crimson. He studied for a year at Trinity College, Cambridge in England before attending Yale Law School, where he was editor-in-chief of the Yale Law Journal. While at Yale, he was a classmate of future President Bill Clinton and future Secretary of State Hillary Clinton. From 1970 to 1976, Blumenthal served in the United States Marine Corps Reserve, where he attained the rank of sergeant. After college, Blumenthal served as administrative assistant and law clerk for several Washington figures. From 1977 to 1981, he was United States Attorney for the District of Connecticut. In the early 1980s he worked in private law practice, including serving as volunteer counsel for the NAACP Legal Defense Fund. He served in the Connecticut House of Representatives from 1984 to 1987, when he was elected to the Connecticut Senate. He was elected state Attorney General in 1990, and served for twenty years. During this period he was frequently speculated as a contender for Governor of Connecticut, but he never pursued the office. Blumenthal announced his 2010 run for U.S. Senate after Democrat incumbent Chris Dodd announced his retirement. He faced professional wrestling magnate Linda McMahon in the general election, winning by a 12-point margin with 55 percent of the vote. On January 5, 2011, he was sworn in and took seats on the Senate Armed Services ; Judiciary ; Aging ; and Health, Education, Labor and Pensions Committees. He became the senior senator after the retirement of Joe Lieberman.", "id": "B001277"}, {"url": "/wiki/Chris_Murphy_(Connecticut_politician)", "last_name": "Murphy", "name": "Chris Murphy", "biography": "Christopher Scott \"Chris\" Murphy (born August 3, 1973) is the junior United States Senator from Connecticut, in office since 2013. He previously served in the United States House of Representatives, representing Connecticut's 5th congressional district from 2007 to 2013. Before being elected to Congress, Murphy was a member of both chambers of the Connecticut General Assembly, serving in the Connecticut House of Representatives (1999-2003) and the Connecticut Senate (2003-07). He is a member of the Democratic Party. Prior to the election of Senator Tom Cotton from Arkansas in 2014, Murphy was the youngest incumbent U.S. Senator, as he was 39 when elected in 2012. After four-term incumbent Joe Lieberman decided to retire, Murphy announced his candidacy for the 2012 U.S. Senate election. He defeated former Connecticut secretary of state Susan Bysiewicz in the Democratic primary, and subsequently defeated Republican candidate Linda McMahon in the general election.", "id": "M001169"}, {"url": "/wiki/Tom_Carper", "last_name": "Carper", "name": "Tom Carper", "biography": "Thomas Richard \" Tom \" Carper (born January 23, 1947) is the senior United States Senator from Delaware, serving since 2001. A member of the Democratic Party, Carper served in the United States House of Representatives from 1983 to 1993 and was the 71st Governor of Delaware from 1993 to 2001. A native of Danville, Virginia, Carper graduated from Ohio State University. Serving as a Naval Flight Officer in the U.S. Navy from 1968 until 1973, he flew the P-3 Orion as a Tactical Coordinator/Mission Commander and saw active duty in the Vietnam War. After leaving the active duty Navy, he remained in the U.S. Naval Reserve for another 18 years and eventually retired with the rank of Captain (O-6). Upon receiving his MBA from the University of Delaware in 1975, Carper went to work for the State of Delaware in its economic development office. He was elected State Treasurer, serving from 1977 to 1983 and leading the development of Delaware's first cash management system. Encouraged by local politicians, Carper successfully ran for Delaware's only seat in the U.S. House of Representatives in 1982. He served five terms in the House, where he chaired the Subcommittee on Economic Stabilization. In 1992 he arranged a swap with term-limited Governor Michael Castle, and the two were easily elected to each other's seats. Carper governed for two terms as a moderate, business-oriented New Democrat, following the lead of the two previous Republican governors. He successfully prevented the closing of a General Motors automobile plant and won a bid for the headquarters of pharmaceutical giant AstraZeneca. He led a tax-reduction campaign and helped improve the state's credit rating from among the worst in the nation to an excellent AAA. He pushed for standards-based education, among other reforms. Carper was elected to the U.S. Senate in 2000, beating Republican incumbent William V. Roth, Jr.. He was re-elected by landslides in 2006 and 2012. As senator, he serves as one of four Deputy Democratic Whips, serves as the ranking member of the Senate Homeland Security Committee and also serves on the Senate Committee on Environment and Public Works and the Senate Committee on Finance. Carper is currently the dean of the Delaware congressional delegation.", "id": "C000174"}, {"url": "/wiki/Chris_Coons", "last_name": "Coons", "name": "Chris Coons", "biography": "Christopher Andrew \"Chris\" Coons (born September 9, 1963) is the junior United States Senator from Delaware and a member of the Democratic Party. He won a special election in 2010 to succeed Ted Kaufman, who had been appointed to the seat when Joe Biden resigned to become Vice President. Previously, Coons was the county executive of New Castle County. Coons is the 1983 Truman Scholar from Delaware, and the first recipient of the award to serve in the United States Senate. A native of Hockessin, Delaware, Coons graduated from Amherst College and received graduate degrees from Yale Divinity School and Yale Law School. He went to work as a volunteer relief worker in Kenya, where he had taken classes in the University of Nairobi, later returning to the U.S. to work for the Coalition for the Homeless in New York. He spent some time as a legal clerk in New York before returning to Delaware in 1996, where he spent eight years as in-house counsel for a materials manufacturing company. In the interim he worked for several nonprofit organizations. He worked on several political campaigns in his early career, including Ronald Reagan's 1980 presidential campaign. In college he switched from being a Republican to a Democrat, and in 1996 he became a delegate from Wilmington to the Democratic National Convention in Chicago. His political career began in earnest on the New Castle County Council in 2000, where he served as council president. He was elected county executive in 2004 and served for six years. There he balanced the county budget with a surplus in fiscal year 2010 by cutting spending and raising taxes, and the county maintained a AAA bond rating. Coons won the 2010 special election against the Republican candidate Christine O'Donnell for the U.S. Senate seat then held by Ted Kaufman, who was appointed after Joe Biden resigned in order to become Vice President. Coons was elected to a full term in 2014 and serves on the Appropriations, Budget, Foreign Relations and Judiciary committees, chairing the Foreign Relations Subcommittee on African Affairs and the Judiciary Subcommittee on Bankruptcy and the Courts.", "id": "C001088"}, {"url": "/wiki/Bill_Nelson", "last_name": "Nelson", "name": "Bill Nelson", "biography": "Clarence William \" Bill \" Nelson II (born September 29, 1942) is an American politician and a member of the Democratic Party who serves as the senior United States Senator from Florida, in office since 2001. Nelson began his career in the Florida House of Representatives, where he served from 1973 to 1979. He then served in the United States House of Representatives from 1979 to 1991. In January 1986, Nelson became the first sitting member of the United States Congress to fly in space. He flew as a Payload Specialist on the Space Shuttle Columbia. He retired from Congress in 1990 to run for Governor of Florida but was unsuccessful. He was appointed as Treasurer, Insurance Commissioner and Fire Marshal of Florida, serving from 1995 to 2001. In 2000, Nelson ran for and was elected to the U.S. Senate seat vacated by retiring Republican Senator Connie Mack III. He was re-elected in 2006 with 60% of the vote and in 2012 with 55% of the vote. In the Senate, he is generally considered a moderate Democrat.", "id": "N000032"}, {"url": "/wiki/Marco_Rubio", "last_name": "Rubio", "name": "Marco Rubio", "biography": "Marco Antonio Rubio (born May 28, 1971) is an American politician and attorney, and the junior United States Senator from Florida. Rubio previously served as Speaker of the Florida House of Representatives. Rubio is a Cuban American from Miami, with degrees from the University of Florida and the University of Miami School of Law. In the late 1990s, he served as a City Commissioner for West Miami and was elected to the Florida House of Representatives in 2000, representing the 111th House district. Later in 2000, Rubio was promoted to be one of two majority whips, and in 2002, he was appointed House Majority Leader by Speaker Johnnie Byrd. Subsequently, he was elected Speaker of the Florida House, serving as Speaker for two years beginning in November 2006. Upon leaving the Florida legislature in 2008 due to term limits, Rubio started a new law firm, and also began teaching at Florida International University, where he continues as an adjunct professor. Rubio successfully ran for United States Senate in 2010. In the U.S. Senate, he chairs the Commerce Subcommittee on Oceans, Atmosphere, Fisheries, and Coast Guard, as well as the Foreign Relations Subcommittee on Western Hemisphere, Transnational Crime, Civilian Security, Democracy, Human Rights and Global Women's Issues. He is one of four Latino Americans serving in the Senate. In April 2015, Rubio announced that he would forgo seeking reelection to the Senate to run for President. He suspended his campaign for President on March 15, 2016, after losing the Republican primary in his home state of Florida to Donald Trump. On June 22, 2016, he reversed his decision not to seek reelection to the Senate and announced a campaign for reelection citing the 2016 Orlando nightclub shooting. Rubio was reelected after defeating Democrat Patrick Murphy in the 2016 general election.", "id": "R000595"}, {"url": "/wiki/Johnny_Isakson", "last_name": "Isakson", "name": "Johnny Isakson", "biography": "John Hardy \" Johnny \" Isakson (born December 28, 1944) is the senior United States Senator from Georgia, in office since 2005, and a member of the Republican Party. Previously, he represented Georgia's 6th Congressional district in the United States House of Representatives from 1999 to 2005. Born in Atlanta, Georgia, Isakson served in the Georgia Air National Guard (1966-1972) and graduated from the University of Georgia. He opened a real estate branch for Northside Realty and later served 22 years as the company's president. After a failed bid for the Georgia House of Representatives in 1974, he was elected in 1976. He served seven terms, including four as minority leader. Isakson was the Republican candidate for governor of Georgia in 1990, but lost. Two years later, he was elected to the Georgia Senate and served one term. He unsuccessfully ran in the Republican primary in the 1996 U.S. Senate elections. After 6th District Congressman and Speaker of the House Newt Gingrich resigned, Isakson ran in the February 1999 special election to succeed him, winning by a 40-point margin. He ran for the U.S. Senate in November 2004 after conservative Democratic incumbent Zell Miller opted not to run for re-election. With the backing of much of Georgia's Republican establishment, he won both the primary and general elections by large margins. He is serving his third term after re-election to the Senate in 2016. He became the senior Senator when Saxby Chambliss retired in 2015.", "id": "I000055"}, {"url": "/wiki/David_Perdue", "last_name": "Perdue", "name": "David Perdue", "biography": "David Alfred Perdue, Jr. (born December 10, 1949) is an American businessman and politician; he is the junior United States Senator from Georgia, having been elected in 2014 to the seat previously held by Saxby Chambliss, who retired. Perdue won the Republican primary and defeated Democratic nominee Michelle Nunn on November 4, 2014, taking office on January 3, 2015. He is a first cousin of Sonny Perdue, former governor of Georgia. Perdue, Jr. started his business career with more than a decade as a management consultant. In 1992 he became a VP at Sara Lee Corporation. During the next decade, he worked with Haggar Clothing, and Reebok. He was unable to correct problems at Pillowtex, which he joined in 2002, leaving after nine months with a large buyout. Perdue next worked for Dollar General, where he did achieve a turnaround, and later for the Gujarat Heavy Chemicals Ltd., which interests in India included textile mills. Before entering politics, Perdue set up a global trading firm in Atlanta, Georgia.", "id": "P000612"}, {"url": "/wiki/Brian_Schatz", "last_name": "Schatz", "name": "Brian Schatz", "biography": "Personal details Born Brian Emanuel Schatz ( 1972-10-20 ) October 20, 1972 (age&#160;44) Ann Arbor, Michigan, U.S. Political party Democratic Spouse(s) Linda Kwok Kai Yun Children 2 Education Pomona College ( BA ) Website Senate website", "id": "S001194"}, {"url": "/wiki/Mazie_Hirono", "last_name": "Hirono", "name": "Mazie Hirono", "biography": "Mazie Keiko Hirono ( メイジー・ヒロノ, Meijī Hirono ?, Japanese name: 広野 慶子 Hirono Keiko, born November 3, 1947) is an American politician and the junior United States Senator from Hawaii, in office since 2013. Hirono, a member of the Democratic Party, previously served as a member of the Hawaii House of Representatives from 1985 to 1995 and as the Lieutenant Governor of Hawaii from 1994 to 2002, serving under Governor Ben Cayetano. She was the Democratic nominee for Governor of Hawaii in 2002 but was defeated by Republican Linda Lingle. She then served as a member of the United States House of Representatives for Hawaii's 2nd congressional district from 2007 to 2013. She is the first elected female Senator from Hawaii, the first Asian-American woman elected to the Senate, the first U.S. Senator born in Japan, and the nation's first Buddhist Senator. She considers herself a non-practicing Buddhist and is often cited with Hank Johnson as the first Buddhist to serve in the United States Congress. She is the third woman to be elected to Congress from the state of Hawaii (after Patsy Mink and Pat Saiki ). The Democratic nominee for the U.S. Senate seat being vacated by the retirement of Daniel Akaka, Hirono won the election, defeating Linda Lingle in a re-match landslide victory by 63% to 37%. Hirono was sworn in on January 3, 2013, by the Vice President and President of the Senate, Joe Biden. Hirono was the only person of Asian ancestry serving in the U.S. Senate until 2016 when senators Tammy Duckworth and Kamala Harris were elected in the states of Illinois and California. She is the current dean of Hawaii's Congressional Delegation.", "id": "H001042"}, {"url": "/wiki/Mike_Crapo", "last_name": "Crapo", "name": "Mike Crapo", "biography": "Michael Dean \"Mike\" Crapo ( KRAY -poh ; born May 20, 1951) is the senior United States Senator from the state of Idaho, elected to office in 1998. A Republican, he previously served as the United States Representative for Idaho's 2nd congressional district from 1993 to 1999. Born in the city of Idaho Falls, Crapo is a graduate of Brigham Young University and Harvard Law School. He practiced law in his home city throughout the 1980s, while also maintaining an active role in local Republican politics. His brother Terry Crapo was majority leader in the Idaho House of Representatives from 1968 to 1972 and an influential political figure until his death from leukemia in 1982. After his brother's death, Crapo successfully ran for the Idaho Senate in 1984. Crapo served as Senate President pro tempore from 1988 to 1992. Crapo was elected to an open seat in Congress in 1992, representing Idaho's 2nd congressional district in the United States House of Representatives. After three terms in the House, he ran for the open seat in the U.S. Senate in 1998 when Dirk Kempthorne vacated it to run for governor. Crapo was elected with 70% of the vote, and became the first Mormon to represent Idaho in the Senate. He ran unopposed in the 2004 election, a rarity in the Senate. He was re-elected again in 2010 with 71% of the vote, and again in 2016 with 66% of the vote.", "id": "C000880"}, {"url": "/wiki/Jim_Risch", "last_name": "Risch", "name": "Jim Risch", "biography": "James Elroy \" Jim \" Risch (born May 3, 1943) is an American Republican politician, rancher, and attorney from Ada County, Idaho, currently serving as the junior United States Senator from Idaho. He previously served as the 39th and 41st Lieutenant Governor (2003-2006, 2007-2009) and the 31st Governor (2006-2007) of Idaho.", "id": "R000584"}, {"url": "/wiki/Dick_Durbin", "last_name": "Durbin", "name": "Dick Durbin", "biography": "Richard Joseph \" Dick \" Durbin (born November 21, 1944) is the senior United States Senator from Illinois, in office since 1997. He has been the Assistant Minority Leader (whip), the second highest position in the Democratic Party leadership in the Senate, since 2015. Durbin was born in East St. Louis, Illinois. He graduated from the Georgetown University School of Foreign Service and Georgetown University Law Center. Working in state legal counsel throughout the 1970s, he made an unsuccessful run for Lieutenant Governor of Illinois in 1978. He was elected to the U.S. House of Representatives in 1982, representing the Springfield -based 20th congressional district. In 1996, he won election to the U.S. Senate by an unexpected 15-point margin. He has served as Senate Democratic Whip since 2005, and for a period of eight years (2007-2015) served as the Senate Majority Whip. He is currently dean of the Illinois congressional delegation, as he has served in Congress since 1983 as a U.S. Representative from Illinois 20th Congressional District, and from 1997 as a U.S. Senator from Illinois. Senator Durbin now serves as the Senate Minority Whip following the 2014 midterm election, where the Republicans gained a majority in the U.S. Senate. Durbin won reelection in the 2014 midterm election, beating his Republican opponent, Jim Oberweis, by a margin of 53.55% to 42.69%.", "id": "D000563"}, {"url": "/wiki/Tammy_Duckworth", "last_name": "Duckworth", "name": "Tammy Duckworth", "biography": "Ladda Tammy Duckworth (born March 12, 1968) is an American politician and member of the Democratic Party, serving as the junior United States Senator for Illinois since 2017. She was a member of the United States House of Representatives for Illinois' 8th district for two terms (2013-2017). She previously served as Assistant Secretary for Public and Intergovernmental Affairs in the United States Department of Veterans Affairs from April 24, 2009, to June 30, 2011, the Director of the Illinois Department of Veterans Affairs from November 21, 2006, to February 8, 2009. In the November 8, 2016, election, Duckworth defeated incumbent Republican Senator Mark Kirk for his seat in the United States Senate. Duckworth is the first Asian American woman elected to Congress in Illinois, the first disabled woman to be elected to the U.S. House of Representatives, and the first member of Congress born in Thailand. Her father, an American, and her Thai-Chinese mother were working and living there at the time. Duckworth is the second Asian-American woman serving in the U.S. Senate after Mazie Hirono and next to Kamala Harris. An Iraq War veteran, Duckworth served as a U.S. Army helicopter pilot and suffered severe combat wounds, losing both of her legs and damaging her right arm. She was the first female double amputee from the war. Having received a medical waiver, she continued to serve as a Lieutenant Colonel in the Illinois Army National Guard along with her husband, Major Bryan W. Bowlsbey, a signal officer and fellow Iraq War veteran, until her retirement from the Army in October 2014.", "id": "D000622"}, {"url": "/wiki/Joe_Donnelly", "last_name": "Donnelly", "name": "Joe Donnelly", "biography": "Joseph Simon \"Joe\" Donnelly, Sr. (born September 29, 1955) is an American politician who is the senior United States Senator from Indiana. A member of the Democratic Party, Donnelly has served in the Senate since January 3, 2013. Born in Massapequa, New York, Donnelly graduated from The University of Notre Dame. He began his career serving on the Indiana State Election Board before working as an attorney in practice. From 1997 to 2001, he was a member of the Mishawaka Marian School Board, serving as the board's President from 2000 to 2001. In 2004, Donnelly ran for the Democratic nomination for a seat in the U.S. House of Representatives, losing to Republican incumbent Chris Chocola in the general election. He challenged Chocola to a rematch in 2006, prevailing in the general election and earning 54% of the vote. He represented Indiana's 2nd congressional district from 2007 to 2013, winning reelection in 2008 and 2010. In May 2011, Donnelly announced his intentions to run for the U.S. Senate, winning the Democratic nomination one year later in an uncontested primary. He then faced Indiana State Treasurer Richard Mourdock, who had defeated 36-year incumbent Richard Lugar in the Republican primary. On November 6, 2012 Donnelly defeated Mourdock in the general election, securing 50% of the vote to Mourdock's 44%.", "id": "D000607"}, {"last_name": "Young", "name": "Todd Young", "url": "/wiki/Todd_Young", "id": "Y000064", "biography": "Todd Christopher Young (born August 24, 1972) is an American politician who is the junior United States Senator from Indiana, serving since 2017. From 2011 to 2017 he was the U.S. Representative for Indiana's 9th congressional district. Young is a member of the Republican Party. He was elected to the United States Senate in the November 8, 2016, general election, succeeding Dan Coats."}, {"url": "/wiki/Chuck_Grassley", "last_name": "Grassley", "name": "Chuck Grassley", "biography": "Charles Ernest \" Chuck \" Grassley (born September 17, 1933) is the senior United States Senator from Iowa, serving since 1981. A member of the Republican Party, he previously served in the United States House of Representatives (1975-1981) and the Iowa state legislature (1959-1974). He was chairman of the Senate Finance Committee from January to June 2001, as well as from January 2003 to December 2006, and is now the current chairman of the Judiciary Committee of the 115th congress.", "id": "G000386"}, {"url": "/wiki/Joni_Ernst", "last_name": "Ernst", "name": "Joni Ernst", "biography": "Joni Kay Ernst ( née Culver ; July 1, 1970) is an American politician who is the junior United States Senator from Iowa, elected in the November 2014 election. She previously served as a Republican member of the Iowa Senate from 2011 to 2014 and as a lieutenant colonel in the Iowa Army National Guard prior to retiring from the military in 2015. Ernst is the first woman to represent Iowa in the United States Congress and the first female veteran from any state to serve in the United States Senate.", "id": "E000295"}, {"url": "/wiki/Pat_Roberts", "last_name": "Roberts", "name": "Pat Roberts", "biography": "Previous official congressional portrait of Pat Roberts Charles Patrick \" Pat \" Roberts (born April 20, 1936) is the senior United States Senator from Kansas. A member of the Republican Party, he has served since 1997. He previously served as the Chairman of the Senate Select Committee on Intelligence. Born in Topeka, Kansas, Roberts is a graduate of Kansas State University. He served as a captain in the U.S. Marine Corps and worked as a newspaper reporter before entering politics in the late 1960s. He was elected to the U.S. House of Representatives in 1980 to succeed 1st District Congressman Keith Sebelius, for whom he had worked. He served eight terms in the House, including one as chairman of the House Agriculture Committee. Roberts was elected to the U.S. Senate in 1996, and is currently serving his fourth term. On the Intelligence Committee, he was responsible for an investigation into the intelligence failures prior to the 2003 invasion of Iraq. He is currently the dean of the Kansas congressional delegation.", "id": "R000307"}, {"url": "/wiki/Jerry_Moran", "last_name": "Moran", "name": "Jerry Moran", "biography": "Gerald W. \" Jerry \" Moran (born May 29, 1954) is the junior United States Senator from Kansas and a member of the Republican Party. He served as Chairman of the National Republican Senatorial Committee for the 113th U.S. Congress, during which he led successful Republican efforts in United States Senate elections, 2014, producing the first Republican Senate majority since 2006. Previously, he served as a member of the United States House of Representatives, representing Kansas's 1st congressional district. Raised in Plainville, Kansas, Moran graduated from the University of Kansas and the University of Kansas School of Law. He worked in private law and served as the state special assistant attorney general (1982-85) and deputy attorney of Rooks County (1987-95). He served in the Kansas Senate (1989-1997), and was majority leader for his last two years. He was elected to the House of Representatives in 1996 and served six terms with little electoral opposition. He was elected to the U.S. Senate in 2010 after defeating fellow U.S. Representative Todd Tiahrt in a contentious primary.", "id": "M000934"}, {"url": "/wiki/Mitch_McConnell", "last_name": "McConnell", "name": "Mitch McConnell", "biography": "Addison Mitchell \" Mitch \" McConnell, Jr. (born February 20, 1942) is an American politician and the senior United States Senator from Kentucky. A member of the Republican Party, he has been the Majority Leader of the Senate since January 3, 2015. He is the 15th Republican and the second Kentuckian to lead his party in the Senate. McConnell is the longest-serving U.S. Senator in Kentucky history. During the administration of President Barack Obama, McConnell was known to the left as being an obstructionist, while opinion on the right was sharply divided. Some on the right praised him for tenacity and courage, while others criticized him for being part of the political establishment and not keeping his promises to conservatives. From early 2016, McConnell refused to schedule Senate hearings for Obama's nominee to the Supreme Court, Merrick Garland, to replace Associate Justice Antonin Scalia, who died in February 2016. Garland's nomination remained before the Senate for 294 days, from March 16, 2016 until it expired on January 3, 2017, more than double the time of any other Supreme Court nomination. McConnell has repeatedly been found to have the lowest home state approval rating of any sitting senator.", "id": "M000355"}, {"url": "/wiki/Rand_Paul", "last_name": "Paul", "name": "Rand Paul", "biography": "Randal Howard \" Rand \" Paul (born January 7, 1963) is an American politician and physician. Since 2011, Paul has been the junior United States Senator representing Kentucky. He is the son of former U.S. Representative Ron Paul of Texas. Born in Pittsburgh, Pennsylvania, Paul attended Baylor University and is a graduate of the Duke University School of Medicine. Paul began practicing ophthalmology in 1993 in Bowling Green, Kentucky, and established his own clinic in December 2007. Throughout Paul's life, he volunteered for his father's campaigns. In 2010, Paul entered politics by running for a seat in the United States Senate. A Republican, Paul has described himself as a Constitutional conservative and a supporter of the Tea Party movement and has advocated for a balanced budget amendment, term limits, and privacy reform. On April 7, 2015, Paul officially announced his candidacy for the Republican nomination at the 2016 U.S. presidential election. He suspended his campaign on February 3, 2016, shortly after the Iowa caucus, where he finished in 5th place out of the 12 Republican candidates.", "id": "P000603"}, {"url": "/wiki/Bill_Cassidy", "last_name": "Cassidy", "name": "Bill Cassidy", "biography": "William Morgan \" Bill \" Cassidy (born September 28, 1957) is an American physician and politician currently serving as the senior United States Senator from the state of Louisiana. He is a member of the Republican Party and served as the U.S. Representative for Louisiana's 6th Congressional District from 2009 to 2015. Cassidy became Louisiana's senior senator when David Vitter retired in 2017. He is the Senate's most junior senior senator.", "id": "C001075"}, {"url": "/wiki/John_Neely_Kennedy", "last_name": "Kennedy", "name": "John N. Kennedy", "biography": "John Neely Kennedy (born November 21, 1951) is an American politician who is the junior United States Senator from Louisiana, serving since 2017. A member of the Republican Party, he served terms as Louisiana state treasurer and took office as Louisiana's junior senator in the United States Senate on January 3, 2017, alongside the state's senior senator Bill Cassidy. He defeated Democratic candidate Foster Campbell in the Senate election runoff by more than 21 percentage points, about a month after prevailing in the state's jungle primary, along with Campbell.", "id": "K000393"}, {"url": "/wiki/Susan_Collins", "last_name": "Collins", "name": "Susan Collins", "biography": "Susan Margaret Collins (born December 7, 1952) is an American politician who currently serves as the senior United States Senator from Maine. A member of the Republican Party, Collins has served in the Senate since 1997, and has served as the Chairwoman of the Senate Special Committee on Aging since 2015 and previously chaired the Senate Committee on Homeland Security from 2003 to 2007. She is considered one of the most moderate Republicans in office. She also is known for her long consecutive voting streak, which reached 6,000 votes in September 2015. She is the current dean of Maine's congressional delegation. Born in Caribou, Maine, Collins is a graduate of St. Lawrence University. Beginning her career as a staff assistant for Senator William Cohen in 1975, Collins later became the staff director of the Oversight of Government Management Subcommittee of the Senate Committee on Homeland Security in 1981. She was then appointed as the Commissioner of the Maine Department of Professional and Financial Regulation by Governor John R. McKernan, Jr. in 1987. In 1992 she was appointed by President George H. W. Bush as the director of the Small Business Administration's regional office in Boston. Staying in Massachusetts, Collins became that state's Deputy State Treasurer in 1993. After moving back to Maine in 1994, Collins became the Republican nominee for Governor in the 1994 general election. Becoming the first woman to become the nominee of a major party for Governor of Maine, Collins finished third in a four way race with 23% of the vote. After her bid for Governor in 1994, Collins became the founding director of the Center for Family Business at Husson University. Collins was first elected to the Senate in 1996. She has been re-elected three times, in 2002, 2008, and 2014. After former Senator Kelly Ayotte lost reelection in 2016, Collins became the only Republican currently representing a state in New England.", "id": "C001035"}, {"url": "/wiki/Angus_King", "last_name": "King", "name": "Angus King", "biography": "Angus Stanley King, Jr. (born March 31, 1944) is an American politician and the junior United States Senator from the state of Maine. As a political independent, he served as the 72nd Governor of Maine from 1995 to 2003, winning his first election in a 4-way race with 35.37% of the vote. King won Maine's 2012 Senate election to replace the retiring Republican Olympia Snowe and took office on January 3, 2013. For committee assignment purposes, he caucuses with the Democratic Party.", "id": "K000383"}, {"url": "/wiki/Ben_Cardin", "last_name": "Cardin", "name": "Ben Cardin", "biography": "Benjamin Louis \" Ben \" Cardin (born October 5, 1943) is an American politician and member of the Democratic Party who serves as the senior United States Senator from Maryland, in office since 2007. Before his election to the Senate, Cardin, who has never lost an election, was a member of the United States House of Representatives, representing Maryland's 3rd congressional district (1987-2007). He also served in the Maryland House of Delegates (1967-87), serving as Speaker (1979-87). He was the youngest Speaker in Maryland history. Cardin was elected to succeed Paul Sarbanes in the 2006 U.S. Senate election, defeating Republican Michael Steele, the Lieutenant Governor of Maryland, by a margin of 54% to 44%. He was re-elected in 2012 with 55% of the vote. He became the senior Senator on January 3, 2017 upon Barbara Mikulski's retirement.", "id": "C000141"}, {"last_name": "Hollen", "name": "Chris Van Hollen", "url": "/wiki/Chris_Van_Hollen", "id": "V000128", "biography": "Christopher \"Chris\" Van Hollen, Jr. (born January 10, 1959) is the junior United States Senator from Maryland, serving since January 3, 2017. From 2003-17, he served as the U.S. Representative for Maryland's 8th congressional district. He is a member of the Democratic Party. After the Democrats regained control of the House in the 2006 elections, Van Hollen became the chairman of the Democratic Congressional Campaign Committee (DCCC), the fifth-ranking position among House Democrats. In this post, Van Hollen was responsible for leading efforts to get more Democrats elected to Congress. Speaker Nancy Pelosi created a new leadership post, Assistant to the Speaker, in 2006 so that Van Hollen could be present at all leadership meetings. After Republicans reclaimed the House in 2010 Van Hollen did not run for re-election for chairman of the DCCC. Van Hollen was instead elected ranking member on the Budget Committee on November 17, 2010. Pelosi appointed him to the 12-member bipartisan Committee on Deficit Reduction with a mandate for finding major budget reductions by late 2011. On October 17, 2013 Pelosi appointed Van Hollen to serve on the bicameral conference committee. Van Hollen ran for the United States Senate in 2016 to replace retiring Senator Barbara Mikulski and won the general election 60 to 36 percent. Van Hollen serves as Chairman of the Democratic Senatorial Campaign Committee (DSCC) for the 2018 cycle."}, {"last_name": "Warren", "name": "Elizabeth Warren", "url": "/wiki/Elizabeth_Warren", "id": "W000817", "biography": "This article is part of a series about Elizabeth Warren"}, {"url": "/wiki/Ed_Markey", "last_name": "Markey", "name": "Ed Markey", "biography": "Edward John \"Ed\" Markey (born July 11, 1946) is an American politician and member of the Democratic Party who is the junior United States Senator from Massachusetts, in office since 2013. From 1976 to 2013 he served as the U.S. Representative for Massachusetts's 5th congressional district. He previously served in the Massachusetts House of Representatives from 1973 to 1976. Markey has focused on energy policy and was Chairman of the House Select Committee on Energy Independence and Global Warming from 2007 to 2011. In 2013, after John Kerry was appointed United States Secretary of State, he was elected to serve out the balance of Kerry's sixth Senate term in a 2013 special election. Markey defeated Stephen Lynch in the Democratic primary and Republican Gabriel E. Gomez in the general election. When he left the House, he was its eighth most senior member. In 2014 Markey was elected to a full six-year Senate term. He is the dean of the Massachusetts congressional delegation and the second longest-serving current member of Congress from New England, behind Senator Patrick Leahy of Vermont.", "id": "M000133"}, {"url": "/wiki/Debbie_Stabenow", "last_name": "Stabenow", "name": "Debbie Stabenow", "biography": "Deborah Ann \" Debbie \" Greer Stabenow (born April 29, 1950) is the senior United States Senator from Michigan and a member of the Democratic Party. Before her election to the U.S. Senate, she was a member of the United States House of Representatives, representing Michigan's 8th congressional district from 1997 to 2001. She previously served as a member of the Ingham County Board of Commissioners, Michigan House of Representatives, and Michigan Senate. Stabenow served as Chairwoman of the Senate Agriculture Committee from 2011 to 2015. She was re-elected to the Senate for a third term in November 2012. She became the state's senior senator upon the retirement of Carl Levin on January 3, 2015. She served as Vice Chair of the Senate Democratic Policy Committee from 2011 to 2017 and became its Chair in 2017.", "id": "S000770"}, {"url": "/wiki/Gary_Peters_(politician)", "last_name": "Peters", "name": "Gary Peters", "biography": "Gary Charles Peters (born December 1, 1958) is an American politician who is the junior United States Senator from Michigan. A member of the Democratic Party, he was the U.S. Representative for Michigan's 14th congressional district from 2013 until his election to the Senate. The district includes the eastern half of Detroit, as well as the Grosse Pointes, Hamtramck, Southfield and Pontiac. He previously represented Michigan's 9th congressional district from 2009 to 2013. Following the redrawing of congressional district boundaries after the 2010 United States Census, Peters defeated fellow Congressman Hansen Clarke in the Democratic primary and won re-election in the newly redrawn 14th District. Prior to his election to Congress, Peters served in the United States Navy Reserve, spent 22 years as an investment advisor, and worked briefly in academia. He was elected to the Rochester Hills City Council in 1991, going on to represent the 14th District in the Michigan Senate from 1995 to 2002. He was the Democratic nominee for Michigan Attorney General in 2002, narrowly losing to Republican Mike Cox. He was then appointed Commissioner of the Michigan Lottery by Governor Jennifer Granholm, serving from 2003 to 2008, when he resigned to run for Congress. In 2014 Peters was elected to the United States Senate seat previously held by retiring Democratic Senator Carl Levin. He was unopposed in the Democratic primary and defeated Republican Terri Lynn Land in the general election. He was the only non-incumbent Democrat to win a 2014 Senate election and was the only Senate freshman from the Democratic Party for the 114th Congress.", "id": "P000595"}, {"url": "/wiki/Amy_Klobuchar", "last_name": "Klobuchar", "name": "Amy Klobuchar", "biography": "Amy Jean Klobuchar (born May 25, 1960) is the senior United States Senator from Minnesota. She is a member of the Minnesota Democratic-Farmer-Labor Party, an affiliate of the Democratic Party. She is the first woman to be elected as a senator for Minnesota and is one of twenty women serving in the current United States Senate. She previously served as the county attorney for Hennepin County, Minnesota, the most populous county in Minnesota. She was a legal adviser to former Vice President Walter Mondale. She has been named by The New York Times and The New Yorker as one of the women most likely to become the first female President of the United States, and by MSNBC and The New Yorker as a possible nominee to the U.S. Supreme Court.", "id": "K000367"}, {"url": "/wiki/Al_Franken", "last_name": "Franken", "name": "Al Franken", "biography": "Alan Stuart \" Al \" Franken (born May 21, 1951) is an American politician, comedian, actor, and writer. He is currently the junior United States Senator from Minnesota. He became well known in the 1970s and 1980s as a writer and performer on the television comedy show Saturday Night Live. After several decades as a comedic actor and writer, he became a prominent liberal political activist. Franken was first elected to the United States Senate in 2008 in a narrow victory over incumbent Republican Senator Norm Coleman, and then handily won re-election in 2014 over Republican challenger Mike McFadden. Franken is a member of the Minnesota Democratic-Farmer-Labor Party (DFL), an affiliate of the Democratic Party. Born in New York City, Franken moved to Minnesota when he was four but he later went back to the East Coast and attended Harvard College. With his writing partner Tom Davis, with whom he had developed an interest in improvisational theatre in high school, he was hired as a writer for SNL at its inception in 1975. He worked on the show as a writer and performer until 1980, and returned from 1985 to 1995. After leaving SNL, he wrote and acted in movies and television shows. He also hosted a nationally syndicated, political radio talk show, The Al Franken Show, and wrote six books, four of which are political satires critical of conservative politics.", "id": "F000457"}, {"url": "/wiki/Thad_Cochran", "last_name": "Cochran", "name": "Thad Cochran", "biography": "William Thad Cochran (born December 7, 1937) is an American Republican politician. He is the current senior United States Senator from Mississippi (the third most-senior Senator and the second most-senior Republican member), first elected to the Senate in 1978, and the Chairman of the Senate Appropriations Committee, which he had also chaired from 2005 to 2007. He also chaired the Senate Agriculture Committee from 2003 to 2005. Cochran won reelection to a seventh term in 2014, after defeating Chris McDaniel in an intense primary run-off election. He is currently the dean of the Mississippi congressional delegation and the second-most senior Republican currently serving in Congress.", "id": "C000567"}, {"url": "/wiki/Roger_Wicker", "last_name": "Wicker", "name": "Roger Wicker", "biography": "Roger Frederick Wicker (born July 5, 1951) is an American politician and member of the Republican Party who serves as the junior United States Senator from Mississippi, in office since 2007. After graduating from the University of Mississippi, Wicker served in the United States Air Force from 1976 to 1980 and worked as a political counselor to then-Congressman Trent Lott. He then served in the Mississippi State Senate from 1988 to 1994, when he was elected to the U.S. House of Representatives from Mississippi's 1st congressional district, succeeding long-time retiring Democrat Jamie L. Whitten, for whom Wicker had once been a Page. Wicker served in the House from January 1995 to December 2007, when he was appointed by Governor Haley Barbour to fill the seat vacated by Trent Lott. He subsequently won the 2008 special election for the remainder of the term and was re-elected to a full term in 2012. He is currently serving as Chairman of the National Republican Senatorial Committee for the 114th U.S. Congress.", "id": "W000437"}, {"url": "/wiki/Claire_McCaskill", "last_name": "McCaskill", "name": "Claire McCaskill", "biography": "Claire Conner McCaskill (born July 24, 1953) is an American politician and member of the Democratic Party who serves as the senior United States Senator from Missouri. The first woman elected to the U.S. Senate from Missouri in her own right, she defeated Republican incumbent Jim Talent in the 2006 election, by a margin of 49.6% to 47.3%. She became the state's senior U.S. Senator upon the retirement of Kit Bond in 2011 and won a bid for re-election in 2012, defeating Republican Todd Akin by a margin of 54.7% to 39.2%. Before her election to the U.S. Senate, McCaskill served as the State Auditor of Missouri from 1999 to 2007. She previously served as Jackson County Prosecutor from 1993 to 1998 and as a member of the Missouri House of Representatives from 1983 to 1989. She ran for Governor of Missouri in the 2004 election, beating Democratic incumbent Bob Holden in the primary election but losing to Republican Matt Blunt in a close general election. A native of Rolla, she graduated from the University of Missouri and studied at Georgetown University. In the 115th Congress, McCaskill will serve as ranking member of the Committee on Homeland Security and Governmental Affairs. As of the 114th Congress, McCaskill served as a senior member of the Committee on Armed Services, Committee on Commerce, Science and Transportation, and ranking member of the Special Committee on Aging and the United States Senate Homeland Security Permanent Subcommittee on Investigations. Before the Democrats lost control of the US Senate in the 2014 General Election, she had been the chair of the Homeland Security Subcommittee on Contracting Oversight and subsequently served as ranking member.", "id": "M001170"}, {"url": "/wiki/Roy_Blunt", "last_name": "Blunt", "name": "Roy Blunt", "biography": "Roy Dean Blunt (born January 10, 1950) is an American politician who currently serves as the junior United States Senator from Missouri, having been in office since 2011. He is a member of the Republican Party. Blunt served as the United States Representative from Missouri's 7th congressional district from 1997 to 2011. The district contains most of Southwest Missouri, anchored in the city of Springfield, as well as the cities of Joplin, Carthage, and Neosho, and the popular tourist destination of Branson. Blunt served as House Majority Whip from 2003 to 2007, and was acting House Majority Leader from September 2005 to February 2006. He was the House Minority Whip during the 110th Congress starting in 2007, but after the 2008 general elections, he announced that he would step down from the position. Blunt successfully ran for United States Senate in 2010. The following year, he was elected vice-chairman of the Senate Republican Conference. Blunt is the current dean of Missouri's Congressional Delegation.", "id": "B000575"}, {"url": "/wiki/Jon_Tester", "last_name": "Tester", "name": "Jon Tester", "biography": "Jonathan \" Jon \" Tester (born August 21, 1956) is the senior United States Senator from Montana, serving since 2007. He is a member of the Democratic Party. Tester was first elected to the Senate in 2006, beating Republican incumbent Conrad Burns in one of the closest Senate races of that year. He won re-election in 2012 against Rep. Denny Rehberg in another close race. Tester previously served as the president of the Montana Senate and worked as a music teacher and farmer. He became the senior Senator in 2014 when Max Baucus resigned. He is currently the dean of the Montana congressional delegation.", "id": "T000464"}, {"url": "/wiki/Steve_Daines", "last_name": "Daines", "name": "Steve Daines", "biography": "Steven David \"Steve\" Daines (born August 20, 1962) is an American businessman, entrepreneur, and Republican politician who is the junior United States Senator from Montana. He was the United States Representative for Montana's at-large congressional district from 2013 to 2015. In the 2014 election, he won an open U.S. Senate seat, defeating Democrat Amanda Curtis.", "id": "D000618"}, {"url": "/wiki/Deb_Fischer", "last_name": "Fischer", "name": "Deb Fischer", "biography": "Debra \"Deb\" Strobel Fischer (born March 1, 1951) is the senior United States Senator from the state of Nebraska. Previously, she was a two-term member of the Nebraska Legislature, representing the 43rd District. She defeated former United States Senator Bob Kerrey in the election held on November 6, 2012, and assumed one of Nebraska's two Senate seats in January 2013. Fischer is a member of the Republican Party.", "id": "F000463"}, {"url": "/wiki/Ben_Sasse", "last_name": "Sasse", "name": "Ben Sasse", "biography": "Benjamin Eric \" Ben \" Sasse ( pronunciation: SASS ; born February 22, 1972) is an American politician. Sasse, a member of the Republican Party, is the junior United States Senator from the state of Nebraska. Sasse earned a doctorate in history from Yale University. He taught at the University of Texas, and served as an assistant secretary in the U.S. Department of Health and Human Services. In 2010, he was named president of Midland University in Fremont, Nebraska. In 2014, he was elected to fill the U.S Senate seat being vacated by Mike Johanns, defeating Democratic Party candidate David Domina by a margin of 65% to 31%.", "id": "S001197"}, {"url": "/wiki/Dean_Heller", "last_name": "Heller", "name": "Dean Heller", "biography": "Dean Arthur Heller (born May 10, 1960) is the senior United States Senator from Nevada and a member of the Republican Party. Heller was elected by the voters of the State of Nevada to the Senate seat in 2012 election and had previously and continuously held the seat after being appointed in 2011 by Nevada Governor Brian Sandoval after the resignation of John Ensign following his resignation as a member of the United States House of Representatives, representing Nevada's 2nd congressional district from 2007 to 2011. Prior to that he served as Secretary of State of Nevada (1995-2007) and a member of the Nevada Assembly (1991-1995). He became the dean of Nevada's Congressional Delegation when his Senate colleague Harry Reid retired in 2017.", "id": "H001041"}, {"url": "/wiki/Catherine_Cortez_Masto", "last_name": "Masto", "name": "Catherine Cortez Masto", "biography": "Catherine Marie Cortez Masto (born March 29, 1964) is an American attorney and politician who is the junior United States Senator from Nevada. She is a member of the Democratic Party. Cortez Masto graduated from University of Nevada, Reno and Gonzaga University School of Law. She worked four years as a civil attorney in Las Vegas and two years as a criminal prosecutor for the U.S. Attorney's Office in Washington, D.C. She was the Attorney General of Nevada from 2007 to 2015, elected to replace George Chanos. She was not eligible to run for a third term in 2014 due to lifetime term limits established by the Nevada Constitution. Cortez Masto defeated Joe Heck in the U.S. Senate election in Nevada to replace outgoing Democratic senator Harry Reid, becoming the first woman elected to represent Nevada in the Senate and the first Latina elected to serve in the Senate. She took office on January 3, 2017.", "id": "C001113"}, {"url": "/wiki/Jeanne_Shaheen", "last_name": "Shaheen", "name": "Jeanne Shaheen", "biography": "Cynthia Jeanne Shaheen (née Bowers ; January 28, 1947) is an American politician who is the Senior United States Senator from New Hampshire, since 2009. A member of the Democratic Party, she is the first female U.S. Senator in New Hampshire's history, was the first woman to be elected Governor of New Hampshire, and she is the first woman to be elected as a U.S. Governor and a U.S. Senator. After serving two terms in the New Hampshire Senate, Shaheen was elected Governor in 1996, and she was re-elected in 1998 and 2000. In 2002, she opted to run for the United States Senate, losing to Republican John E. Sununu. She served as Director of the Harvard Institute of Politics, before resigning to run for the U.S. Senate again in the 2008 election, defeating Sununu in a rematch. Shaheen became the first Democratic Senator from New Hampshire since John A. Durkin, who was defeated in 1980. In 2014, She became only the second Democrat from New Hampshire to be re-elected to the U.S. Senate, and the first since Thomas J. McIntyre in 1972.", "id": "S001181"}, {"url": "/wiki/Maggie_Hassan", "last_name": "Hassan", "name": "Maggie Hassan", "biography": "Margaret \" Maggie \" Hassan (née Wood ; born February 27, 1958) is an American attorney and politician who is the junior United States Senator from New Hampshire. A Democrat, Hassan was elected to the Senate in the 2016 election and served as the 81st Governor of New Hampshire from 2013 to 2017. Born in Boston, Massachusetts, Hassan is a graduate of Brown University and earned her J.D. from the Northeastern University School of Law. After graduating from law school in 1985, Hassan was an attorney and healthcare executive in Boston. Hassan first ran for the New Hampshire Senate in 2002 after Democratic Party leaders recruited her to run, as they have also done for United States Senate. She lost to incumbent Senator Russell Prescott, but ran against Prescott again in 2004 and won. Hassan was elected to a total of three two-year terms, representing New Hampshire's 23rd district, from January 2005 to December 2010. Hassan became the Democrat Majority Leader in the State Senate in 2008 before losing re-election in 2010. Hassan declared her candidacy for governor in October 2011. Hassan defeated former State Senator Jacalyn Cilley in the Democratic primary, and faced attorney and Republican nominee Ovide M. Lamontagne in the general election. Hassan won with 55% of the vote, becoming the second woman to be elected to the office, after fellow Democrat, and fellow U.S. Senator Jeanne Shaheen. Hassan won re-election as governor on November 4, 2014. Since becoming Governor of New Hampshire, Hassan was elected Vice Chair of the Democratic Governors Association and served as a superdelegate at the Democratic National Convention. In 2016, she ran for the U.S. Senate and narrowly defeated Kelly Ayotte, the Republican incumbent in New Hampshire, by just 1,017 votes. She is serving with Jeanne Shaheen ; both politicians have served as New Hampshire governor.", "id": "H001076"}, {"url": "/wiki/Bob_Menendez", "last_name": "Menendez", "name": "Bob Menendez", "biography": "Robert \" Bob \" Menendez (born January 1, 1954) is the senior United States Senator from the State of New Jersey. He is a member of the Democratic Party of the United States. First appointed to the U.S. Senate in January 2006, he was later elected Chair of the United States Senate Committee on Foreign Relations in January 2013. In 1974, at the age of 20, he was first elected to the Union City School District's Board of Education. In 1986, won the election for Mayor of Union City. In 1988, while continuing to serve as mayor, he was elected to represent the state's 33rd district in the General Assembly of New Jersey and, within three years, moved to the New Jersey State Senate, upon winning the March 1991 special election for the 33rd Senate district. The next year he won a seat in the Congress of the United States for the House of Representatives and represented New Jersey's 13th congressional district for six two-year terms, from 1993 to 2006. In January 2006, he was appointed to fill the U.S. Senate seat being vacated by Jon Corzine (who had been elected 54th Governor of New Jersey ), and was elected to a full six-year term in November and re-elected following in 2012. Menendez is one of four Latinos in the Senate. In 2015, he was ranked #1 on The Hudson Reporter's annual Power List of the \"Fifty Most Powerful Political Figures in Hudson County \". On April 1, 2015, Menendez was indicted on federal corruption charges in the United States District Court, related to alleged favors he did for Florida ophthalmologist Salomon Melgen and gifts he received from him, including campaign donations and private flights. Melgen was charged as well. Menendez has pleaded not guilty to all charges.", "id": "M000639"}, {"url": "/wiki/Cory_Booker", "last_name": "Booker", "name": "Cory Booker", "biography": "Listen to this article ( info/dl ) This audio file was created from a revision of the \" Cory Booker \" article dated 3 November 2013, and does not reflect subsequent edits to the article. ( Audio help ) More spoken articles Cory Anthony Booker (born April 27, 1969) is an American politician and the junior United States Senator from New Jersey, in office since 2013. Previously he served as mayor of Newark from 2006 to 2013. He attended Stanford University, where he played college football and received a Bachelor of Arts in political science and a Master of Arts in sociology, before earning a Rhodes Scholarship to attend the University of Oxford. Upon returning home, he received his Juris Doctor from Yale Law School. Booker began his political career as a Newark city councilor from 1998 to 2002. He ran for mayor in 2002, but lost to incumbent Sharpe James ; he ran again in 2006 and won against deputy mayor Ronald Rice. During his tenure as mayor, Booker's priorities were reducing crime and encouraging economic development projects. He gained a national reputation for his personal involvement in public service, particularly through his use of social media tools such as Twitter to connect with constituents. Considered one of the most prominent Democrats in New Jersey, he became a candidate for the United States Senate in the 2013 special election to succeed Frank Lautenberg, who died in office. He won the Senate Democratic primary on August 13, 2013, and then won the general election against Steve Lonegan on October 16, 2013, becoming the first black U.S. Senator from New Jersey. Booker subsequently won the next regular election for the Senate seat against Jeff Bell in 2014.", "id": "B001288"}, {"url": "/wiki/Tom_Udall", "last_name": "Udall", "name": "Tom Udall", "biography": "Thomas Stewart \" Tom \" Udall (born May 18, 1948) is the senior United States Senator from New Mexico and a member of the Democratic Party. First elected to the Senate in 2008, he represented New Mexico's 3rd congressional district as a member of the United States House of Representatives from 1999 to 2009, and was the Attorney General of New Mexico from 1991 to 1999. A member of the Udall family, he is the son of Stewart Udall, the nephew of Mo Udall, and the cousin of Mark Udall. He is the current dean of New Mexico's Congressional Delegation.", "id": "U000039"}, {"url": "/wiki/Martin_Heinrich", "last_name": "Heinrich", "name": "Martin Heinrich", "biography": "Martin Trevor Heinrich (born October 17, 1971) is an American politician and businessman, the junior United States Senator for New Mexico, in office since 2013. From 2009 to 2013 Heinrich was the U.S. Representative for New Mexico's 1st congressional district. He is a member of the Democratic Party. Heinrich won the Senate seat vacated by retiring Senator Jeff Bingaman in 2012. Heinrich was mentioned as a possible nominee for vice president in 2016 under Democratic presidential nominee Hillary Clinton. However, Senator Tim Kaine from Virginia was later selected for the ticket.", "id": "H001046"}, {"url": "/wiki/Chuck_Schumer", "last_name": "Schumer", "name": "Chuck Schumer", "biography": "Charles Ellis \" Chuck \" Schumer (born November 23, 1950) is an American politician, the senior United States senator from New York and a member of the Democratic Party. First elected in 1998, he defeated three-term Republican incumbent Al D'Amato by a margin of 55%-44%. Schumer was re-elected in 2004 by a margin of 71%-24%, in 2010 by a margin of 66%-33% and in 2016 by a margin of 70%-27%. Before his election to the Senate, Schumer served in the House of Representatives from 1981 to 1999, representing New York's 16th congressional district, later redistricted to the 10th congressional district in 1983 and to the 9th congressional district in 1993. A native of Brooklyn and graduate of Harvard College and Harvard Law School, he was a three-term member of the New York State Assembly, serving from 1975 to 1980. Schumer was chairman of the Democratic Senatorial Campaign Committee from 2005 to 2009, in which post he oversaw a total of 14 Democratic gains in the Senate in the 2006 and 2008 elections. He was the third-ranking Democrat in the Senate, behind Senate minority leader Harry Reid and Senate minority whip Dick Durbin, elected vice chairman of the Democratic Caucus in the Senate in 2006. In November 2010, he was also chosen to hold the additional role of chairman of the Senate Democratic Policy Committee starting at the opening of the 112th Congress. On November 8, 2016, Schumer was reelected to his fourth term in the United States Senate. Subsequently, on November 16, 2016, he was unanimously elected Senate minority leader to succeed the retiring Harry Reid.", "id": "S000148"}, {"url": "/wiki/Kirsten_Gillibrand", "last_name": "Gillibrand", "name": "Kirsten Gillibrand", "biography": "Kirsten Elizabeth Gillibrand (née Rutnik ; i KEER -stən JIL -ə-brand ; born December 9, 1966) is an American politician and the junior United States Senator from New York, in office since 2009. Previously, she served in the United States House of Representatives, representing New York's 20th congressional district (2007-09). She is a member of the Democratic Party. In December 2008, President-elect Barack Obama nominated Hillary Clinton as Secretary of State, leaving an empty seat in the New York senate delegation. After two months and many potential names considered, Governor David Paterson appointed Gillibrand to fill the seat. Gillibrand was required to run in a special election in 2010, which she won with 63% of the vote. She was re-elected to a full six-year term in 2012 with 72% of the vote, the highest margin for any statewide candidate in New York. A member of the Democratic Party's relatively conservative Blue Dog faction while in the House, Gillibrand has been seen as a progressive since her appointment to the Senate. In both cases, her views were significantly defined by the respective constituency she served at the time —a conservative congressional district versus the generally liberal state of New York. For example, although she had been quiet on the U.S. military's \" Don't Ask, Don't Tell \" policy when she was in the House, during her first 18 months in the Senate, Gillibrand was an important part of the successful campaign to repeal it.", "id": "G000555"}, {"url": "/wiki/Richard_Burr", "last_name": "Burr", "name": "Richard Burr", "biography": "Richard Mauze Burr (born November 30, 1955) is the senior United States Senator from North Carolina having served since 2005. A member of the Republican Party, Burr represented North Carolina's 5th congressional district in the United States House of Representatives from 1995 to 2005. Prior to his political career, he worked for seventeen years in private business with Carswell Distributing.", "id": "B001135"}, {"url": "/wiki/Thom_Tillis", "last_name": "Tillis", "name": "Thom Tillis", "biography": "Thomas Roland \" Thom \" Tillis (born August 30, 1960) is an American politician who is the junior United States Senator from North Carolina. He served as a member of the North Carolina House of Representatives from Mecklenburg County, and Speaker of the House, and was also the Republican Party's nominee for the 2014 U.S. Senate election in North Carolina, defeating Democratic incumbent Kay Hagan.", "id": "T000476"}, {"url": "/wiki/John_Hoeven", "last_name": "Hoeven", "name": "John Hoeven", "biography": "John Henry Hoeven III (born March 13, 1957) is an American politician and the senior United States Senator from North Dakota, in office since 2011. A member of the North Dakota Republican Party, he previously served as the 31st Governor of North Dakota from December 2000 to December 2010. Hoeven was elected to the U.S. Senate in the November 2, 2010 general election. He replaced junior Senator Byron L. Dorgan, who chose not to seek re-election. Hoeven became the senior Senator in 2013 after Kent Conrad retired and was replaced by Heidi Heitkamp, who was once Hoeven's opponent for the Governor's office. Prior to his election to the Governor's office, Hoeven served as the president of the nation's only state-owned bank, the Bank of North Dakota, from 1993 to 2000.", "id": "H001061"}, {"url": "/wiki/Heidi_Heitkamp", "last_name": "Heitkamp", "name": "Heidi Heitkamp", "biography": "Mary Kathryn \" Heidi \" Heitkamp (born October 30, 1955) is an American attorney and politician who has been the junior United States Senator from North Dakota since 2013. A member of the North Dakota Democratic-Nonpartisan League Party, she is the first woman elected to the US Senate from North Dakota. She served as the 28th North Dakota Attorney General from 1993 to 2001 and as State Tax Commissioner from 1989 to 1993. Heitkamp ran for governor of North Dakota in 2000 and lost to Republican John Hoeven. She considered a bid for the Democratic nomination in the 2010 U.S. Senate election to replace retiring Senator Byron Dorgan, but on March 3, 2010, declined to run against Hoeven, who was ultimately elected. In November 2011, Heitkamp declared her candidacy to replace Kent Conrad as U.S. Senator from North Dakota in the 2012 election. She narrowly defeated Republican Congressman Rick Berg on November 6, 2012, in that year's closest Senate race. Berg conceded the next day. Heitkamp is North Dakota's second female senator, after Jocelyn Burdick, who was appointed to the office. In December 2016, it was reported that Heitkamp was being considered for agriculture secretary by president-elect Donald Trump, but she was not officially chosen for any cabinet positions.", "id": "H001069"}, {"url": "/wiki/Sherrod_Brown", "last_name": "Brown", "name": "Sherrod Brown", "biography": "Sherrod Campbell Brown (born November 9, 1952) is the senior United States Senator from Ohio, in office since January 3, 2007. Brown is a member of the Democratic Party. Before his election to the Senate, he was a member of the United States House of Representatives, representing Ohio's 13th congressional district from 1993 to 2007. He previously served as the Ohio Secretary of State (1983-1991) and as a member of the Ohio House of Representatives (1974-1982). Brown defeated two-term Republican incumbent Mike DeWine in the 2006 Senate election and was re-elected in 2012, defeating state Treasurer Josh Mandel. In the Senate, he was chairman of the Agriculture Subcommittee on Hunger, Nutrition and Family Farms and the Banking Subcommittee on Economic Policy, and is also a member of the Committee on Finance, Committee on Veterans' Affairs, and Select Committee on Ethics. Beginning in January 2015 at the start of the 114th Congress, Brown became the Ranking Democratic Member on the Committee on Banking, Housing, and Urban Affairs.", "id": "B000944"}, {"url": "/wiki/Rob_Portman", "last_name": "Portman", "name": "Rob Portman", "biography": "Robert Jones \" Rob \" Portman (born December 19, 1955) is an American lawyer and the junior United States Senator from Ohio, in office since 2011. Previously he served as a congressman, as the 14th United States Trade Representative, and as the 35th Director of the Office of Management and Budget. Born in Cincinnati, Ohio, Portman graduated from Dartmouth College and the University of Michigan Law School. He worked briefly in the White House during the George H. W. Bush administration before entering the U.S. House of Representatives, representing the eastern half of Greater Cincinnati and neighboring counties along the Ohio River, and serving six consecutive terms. Portman resigned from Congress to serve as U.S. Trade Representative from May 2005 to May 2006. As Trade Representative, Portman is cited for initiating worldwide trade agreements between other countries and the United States, and pursuing claims against China and the European Union at the World Trade Organization. He later served in the George W. Bush administration from May 2006 to June 2007 as Director of the Office of Management and Budget, where he advocated a balanced budget. Portman is married and has three children. A center-right member of the Republican Party, Portman was elected U.S. Senator in 2010. He has been listed as a possible Republican vice presidential candidate in the past two presidential elections. In the Senate, Portman was a member of the Congressional Joint Select Committee on Deficit Reduction. Throughout his time in Congress, the Cabinet, and the Senate, Portman has visited over thirty countries, including Israel, China, and Iraq. In 2013, Portman became the first incumbent statewide or national-level Republican to publicly support legal recognition of same-sex marriage since Lincoln Chafee in 2004.", "id": "P000449"}, {"url": "/wiki/Jim_Inhofe", "last_name": "Inhofe", "name": "Jim Inhofe", "biography": "James Mountain \"Jim\" Inhofe (born November 17, 1934) is the senior United States senator from Oklahoma and a member of the Republican Party. First elected to the Senate in 1994, he was the ranking member of the United States Senate Committee on Environment and Public Works (EPW) and was its chairman from 2003 to 2007, and again from January 2015 until January 2017. Inhofe served eight years as the United States representative for Oklahoma's 1st congressional district before his election to the Senate in 1994 and also previously served as both an Oklahoma state representative and senator. Early during the Republican Party presidential primaries in 2016, Inhofe endorsed fellow Republican John Kasich.", "id": "I000024"}, {"url": "/wiki/James_Lankford", "last_name": "Lankford", "name": "James Lankford", "biography": "James Paul Lankford (born March 4, 1968) is an American politician who is the junior United States Senator from Oklahoma. A member of the Republican Party, he served as the U.S. Representative for Oklahoma's 5th congressional district from 2011 to 2015. From 1996 to 2009, Lankford was the student ministries and evangelism specialist for the Baptist General Convention of Oklahoma, and he was director of the Falls Creek youth programming at the Falls Creek Baptist Conference Center in Davis, Oklahoma. He stepped down on September 1, 2009, to run for Congress. In January 2014, Lankford announced he would run in the 2014 special Senate election to succeed Tom Coburn. He subsequently won the June 2014 primary with 57% of the vote, becoming the Republican nominee for the November election. He would go on to win with nearly 68% of the vote.", "id": "L000575"}, {"url": "/wiki/Ron_Wyden", "last_name": "Wyden", "name": "Ron Wyden", "biography": "Ronald Lee \" Ron \" Wyden (born May 3, 1949) is the senior United States Senator for Oregon, serving since 1996, and a member of the Democratic Party. He previously served in the United States House of Representatives from 1981 to 1996. He is the current dean of Oregon's Congressional Delegation.", "id": "W000779"}, {"url": "/wiki/Jeff_Merkley", "last_name": "Merkley", "name": "Jeff Merkley", "biography": "Jeffrey Alan \" Jeff \" Merkley (born October 24, 1956) is the junior United States Senator from Oregon. A member of the Democratic Party, Merkley was a five-term member of the Oregon House of Representatives representing House District 47, located in eastern Multnomah County within the Portland city limits. He also served as Speaker of the Oregon House of Representatives. He defeated two-term Republican incumbent Gordon Smith in the 2008 U.S. Senate election and Republican challenger Monica Wehby in the 2014 U.S. Senate election.", "id": "M001176"}, {"last_name": "Jr.", "name": "Bob Casey Jr.", "url": "/wiki/Bob_Casey_Jr.", "id": "C001070", "biography": "Robert Patrick \" Bob \" Casey Jr. (born April 13, 1960) is an American attorney and politician, currently the senior United States Senator from Pennsylvania. He previously served as Pennsylvania Auditor General from 1997 to 2005 and as Pennsylvania Treasurer from 2005 to 2007. Born in Scranton, Pennsylvania, Casey is the son of Robert P. Casey, a former Governor of Pennsylvania. After graduating from Scranton Preparatory School in 1978, he attended the College of the Holy Cross. He received his law degree from the Columbus School of Law at The Catholic University of America. Casey practiced law in Scranton, Pennsylvania, before beginning his political career as Pennsylvania's Auditor General, a post to which he was elected to in 1996 and re-elected in 2000. In the 2002 Pennsylvania gubernatorial election, Casey attempted to follow his father's footsteps in a run for Governor of Pennsylvania. He was defeated, however, in the Democratic primary by eventual general election victor Ed Rendell. After being term-limited out of his position as auditor general, Casey was elected state treasurer in the 2004 election. Casey defeated incumbent Republican U.S. Senator Rick Santorum in the 2006 election. He was re-elected in 2012 and is the first Democrat to be elected to a full term and the first to win re-election to the U.S. Senate from Pennsylvania since Joseph S. Clark Jr. in 1962."}, {"url": "/wiki/Pat_Toomey", "last_name": "Toomey", "name": "Pat Toomey", "biography": "Patrick Joseph \" Pat \" Toomey (born November 17, 1961) is an American businessman and politician. He is the junior United States Senator for Pennsylvania, in office since 2011, and a member of the Republican Party. Previously, Toomey served as a United States Representative for three terms, from 1999 to 2005, but he did not seek a fourth term in compliance with a term limits pledge he had made while running for office in 1998. Toomey attended La Salle Academy in Providence, Rhode Island before earning a B.A. in government from Harvard College. He was employed first by Chemical Bank and subsequently by Morgan, Grenfell &amp; Co. beginning in 1984 and 1986, respectively, until resigning from the latter in 1991. Prior to being elected to the U.S. Senate, Toomey served as the U.S. Representative for Pennsylvania's 15th congressional district from 1999 to 2005. He narrowly lost the Republican primary for United States Senate in 2004. From 2005 to 2009, he served as president of the Club for Growth. After becoming the Republican nominee for the 2010 U.S. Senate election in Pennsylvania, Toomey was elected to the seat on November 2, 2010, defeating his Democratic opponent, former U.S. Navy Three-star admiral and Congressman Joe Sestak. He is currently the only Republican holding statewide office in Pennsylvania. In the U.S. Senate, Toomey serves on the Committee on Banking, Housing, and Urban Affairs, the Committee on the Budget, the Committee on Finance, and the Congressional Joint Economic Committee, among others including several subcommittees. In 2011, he also served on the Joint Select Committee on Deficit Reduction. In April 2012, Toomey was named to succeed South Carolina Senator Jim DeMint as chairman of the United States Senate Steering Committee, a Senate Republican caucus. Toomey was re-elected on November 8, 2016, to his second term as the junior United States Senator from Pennsylvania, defeating Katie McGinty in the general election.", "id": "T000461"}, {"url": "/wiki/Jack_Reed_(politician)", "last_name": "Reed", "name": "Jack Reed", "biography": "John Francis \" Jack \" Reed (born November 12, 1949), is the senior United States Senator from Rhode Island, serving since 1997. A member of the Democratic Party, he previously served in the United States House of Representatives for Rhode Island's 2nd congressional district from 1991 to 1997.", "id": "R000122"}, {"url": "/wiki/Sheldon_Whitehouse", "last_name": "Whitehouse", "name": "Sheldon Whitehouse", "biography": "Sheldon T. Whitehouse (born October 20, 1955) is an American politician and the junior United States Senator from Rhode Island, serving since 2007. He is a member of the Democratic Party and previously served as a United States Attorney from 1993 to 1998 and as the Attorney General of Rhode Island from 1999 to 2003.", "id": "W000802"}, {"url": "/wiki/Lindsey_Graham", "last_name": "Graham", "name": "Lindsey Graham", "biography": "Lindsey Olin Graham (born July 9, 1955) is an American politician and member of the Republican Party who has served as a United States Senator from South Carolina since 2003 and the senior Senator from South Carolina since 2005. Born in Central, South Carolina, Graham graduated from the University of South Carolina in 1977. He received his Juris Doctor from the University of South Carolina School of Law in 1981. He served in the United States Air Force from 1982 to 1988 and served as a Guardsman first in the South Carolina Air National Guard then in the Air Force Reserves, attaining the rank of colonel. He worked as a lawyer in private practice before he was elected to the South Carolina House of Representatives in 1992, serving one term from 1993 to 1995. He then served in the United States House of Representatives, representing South Carolina's 3rd congressional district from 1995 to 2003. He was elected to four terms, receiving at least 60% of the vote each time. In 2002, Graham ran for the U.S. Senate after eight-term Republican incumbent Strom Thurmond announced his retirement. Graham won the primary unopposed and defeated Democratic opponent Alex Sanders in the general election. Graham was re-elected to a second term in 2008, defeating Bob Conley. He won a third term in 2014, defeating Democrat Brad Hutto and Independent Thomas Ravenel. Graham is known in the Senate for his advocacy of a strong national defense, his support of the military, and as an advocate of strong United States leadership in world affairs. He is also known for his willingness to be bipartisan and work with Democrats on issues like global warming, tax reform and immigration reform and his belief that judicial nominees should not be opposed solely on their philosophical positions. He is also a critic of the Tea Party movement, arguing for a more inclusive Republican Party. [10] [11] [12] On May 18, 2015, Graham informally announced his candidacy for President of the United States, [13] followed by a formal announcement on June 21, 2015, in his hometown of Central, South Carolina. [14] On December 21, 2015, Graham ended his campaign for the presidency. [15] Graham later endorsed Jeb Bush for President. [16] After Bush suspended his campaign on February 20, Graham subsequently endorsed Ted Cruz. [17] When it seemed certain that Donald Trump would become the Republican Presidential candidate in early May 2016, Graham announced he would not vote for Trump. [18]", "id": "G000359"}, {"url": "/wiki/Tim_Scott", "last_name": "Scott", "name": "Tim Scott", "biography": "Timothy Eugene \" Tim \" Scott (born September 19, 1965) is an American politician and the junior United States Senator for South Carolina. A Republican, he joined the Senate in 2013 when South Carolina Governor Nikki Haley named him to fill the U.S. Senate seat vacated by Jim DeMint. Scott won a special election in 2014 for the final two years of DeMint's second term, and won election to a full term in 2016. In November 2010, Scott was elected to the United States House of Representatives for South Carolina's 1st congressional district, and served from 2011 to 2013. Scott, a fiscal and cultural conservative, was endorsed for the Senate by Tea Party groups. He served one term in the South Carolina General Assembly (2009-2011); prior to that, he had been on the Charleston County Council from 1996 to 2008. Along with Democrats Cory Booker of New Jersey and Kamala Harris of California, Scott is one of three African Americans serving in the United States Senate. He is the first African-American senator from the state of South Carolina, the first black Republican elected to the United States Senate since the election of Edward Brooke in 1966, and the first elected from the South since 1881, four years after the end of Reconstruction. He is the first Republican African-American Congressman from South Carolina since 1897 and since the passage of the Voting Rights Act of 1965. He is also the first African American to have been elected to both the U.S. House of Representatives and the U.S. Senate since P.B.S. Pinchback.", "id": "S001184"}, {"url": "/wiki/John_Thune", "last_name": "Thune", "name": "John Thune", "biography": "John Randolph Thune (born January 7, 1961) is an American politician and senior United States Senator from South Dakota, a member of the Republican Party. He previously served as a United States Representative for South Dakota's at-large congressional district. He became South Dakota's senior senator with the retirement of Tim Johnson in 2015. He is South Dakota's senior senator, having served as the GOP's Chief Deputy Whip in 2006, chairman of the Republican Policy Committee in June 2009, and Republican Conference Chairman in 2011, the third-ranking position in the Senate. He has worked in politics and civic organizations since completing his MBA graduate degree. He is also the current dean of South Dakota's congressional delegation.", "id": "T000250"}, {"url": "/wiki/Mike_Rounds", "last_name": "Rounds", "name": "Mike Rounds", "biography": "Marion Michael \"Mike\" Rounds (born October 24, 1954) is an American politician and the junior United States Senator from South Dakota, since January 2015. A member of the Republican Party, Rounds served as the 31st Governor of South Dakota from 2003 to 2011, having previously served in the South Dakota Senate from 1991 to 2001. He holds the U.S. Senate seat previously held by retired Democrat Tim Johnson.", "id": "R000605"}, {"url": "/wiki/Lamar_Alexander", "last_name": "Alexander", "name": "Lamar Alexander", "biography": "Andrew Lamar Alexander, Jr. (born July 3, 1940) is an American politician, and the senior United States Senator from Tennessee, having served since 2003. A member of the Republican Party, Alexander previously served as the conference chair of the Republican Party in the US Senate from 2007 to 2012. Born in Maryville, Tennessee, Alexander is a graduate of Vanderbilt University and New York University School of Law. He worked as a legislative assistant to Senator Howard Baker and as an assistant in the Nixon Administration in the late 1960s. He won the Republican nomination for the 1974 Tennessee gubernatorial election but was defeated by Congressman Ray Blanton in the general election. In 1978, Alexander defeated Knoxville Democrat Jake Butcher for the governorship, serving as the 45th Governor of Tennessee from 1979 to 1987. In 1991, he was nominated by President George H. W. Bush to serve as Secretary of Education, from 1991 to 1993. Alexander ran unsuccessfully for the Republican presidential nomination in 1996 and 2000. He defeated Democratic Congressman Bob Clement to replace outgoing Senator Fred Thompson in 2002 and was re-elected in 2008 and 2014.", "id": "A000360"}, {"url": "/wiki/Bob_Corker", "last_name": "Corker", "name": "Bob Corker", "biography": "Robert Phillips \" Bob \" Corker, Jr. (born August 24, 1952) is an American politician and the junior United States Senator from Tennessee, serving since 2007. Corker, a member of the Republican Party, is currently the chairman of the United States Senate Committee on Foreign Relations in the 115th Congress. In 1978, Corker founded a successful construction company, which he sold in 1990. He ran for the 1994 U.S. Senate election in Tennessee, but was defeated by future Senate Majority Leader Bill Frist in the Republican primary. Appointed by Tennessee Governor Don Sundquist, Corker served as Commissioner of Finance and Administration for the State of Tennessee from 1995 to 1996. He later acquired two of the largest real estate companies in Chattanooga, Tennessee, before being elected the 71st Mayor of Chattanooga in 2000; he served one term as mayor from 2001 to 2005. Corker announced his candidacy for the 2006 U.S. Senate election in Tennessee after Frist, a two-term incumbent, announced his retirement from the Senate. Corker defeated Democratic Representative Harold Ford, Jr. in the general election, with 51% of the vote. In 2012 Corker was re-elected, defeating Democrat Mark E. Clayton, 65% to 30%.", "id": "C001071"}, {"url": "/wiki/John_Cornyn", "last_name": "Cornyn", "name": "John Cornyn", "biography": "John Cornyn III (born February 2, 1952) is an American politician and the senior United States Senator from Texas, serving since 2002. He is a member of the Republican Party and the current Senate Majority Whip for the 115th Congress. Cornyn previously served as Chairman of the National Republican Senatorial Committee from 2007 to 2011. Born in Houston, Cornyn is a graduate from Trinity University and St. Mary's University School of Law, receiving his LL.M. from the University of Virginia School of Law. Cornyn was a Judge on Texas' 37th District Court from 1985 to 1991, until he was elected an associate justice of the Texas Supreme Court, where he served 1991 to 1997. In 1998, Cornyn was elected Attorney General of Texas, serving one term until winning a seat in the U.S. Senate in 2002. He was re-elected to a second term in 2008 and to a third term in 2014.", "id": "C001056"}, {"url": "/wiki/Ted_Cruz", "last_name": "Cruz", "name": "Ted Cruz", "biography": "Rafael Edward \" Ted \" Cruz (born December 22, 1970) is an American politician and attorney, who has served as the junior United States Senator from Texas since 2013. He was a candidate for the Republican nomination for President of the United States in the 2016 election. Cruz graduated from Princeton University, New Jersey, in 1992, and from Harvard Law School, Massachusetts, in 1995. From 1999 to 2003, he served in various political appointee positions: the Director of the Office of Policy Planning at the Federal Trade Commission (FTC), an Associate Deputy Attorney General at the United States Department of Justice, and a Domestic Policy Advisor to George W. Bush on the 2000 George W. Bush Presidential campaign. Cruz served as Solicitor General of Texas, from 2003 to 2008, appointed by Texas Attorney General, Greg Abbott. He was the first Hispanic, and the longest-serving, Solicitor General in Texas history. From 2004 to 2009, Cruz was an Adjunct Professor at the University of Texas School of Law in Austin, Texas, where he taught U.S. Supreme Court litigation. Cruz ran for the Senate seat vacated by fellow Republican Kay Bailey Hutchison and, in July 2012, defeated Lieutenant Governor David Dewhurst during the Republican primary runoff, 57-43%. He defeated former State Representative Paul Sadler in the November 2012 general election, winning 56-41%. He is the first Hispanic American to serve as a U.S. Senator representing Texas, and is one of three senators of Cuban descent. He chairs the Senate Judiciary Subcommittee on Oversight, Federal Rights and Agency Activities, and is the Chairman of the Senate Commerce Subcommittee on Space, Science and Competitiveness. In November 2012, he was appointed Vice-Chairman of the National Republican Senatorial Committee. Cruz began campaigning for the Republican presidential nomination in March 2015. During the primary campaign, his base of support was strongest with \"women, white evangelical Protestants, people over the age of 50, and those who identified themselves as conservatives\", though he had crossover appeal to other factions within his party, including libertarian conservatives and millennials. Cruz's victory in the February 2016 Iowa caucuses marked the first time a Hispanic person won a U.S. presidential caucus or primary. He eventually emerged as the main challenger to frontrunner Donald Trump. He suspended his campaign for president on May 3, 2016, after losing the Republican primary in Indiana to Trump.", "id": "C001098"}, {"url": "/wiki/Orrin_Hatch", "last_name": "Hatch", "name": "Orrin Hatch", "biography": "Orrin Grant Hatch (born March 22, 1934) is an American politician who is the President pro tempore of the United States Senate, since January 2015. A member of the Republican Party, he serves as the senior United States Senator for Utah. In office since 1977, Hatch is the most senior Republican Senator, the second-most senior Senator overall, after Democrat Patrick Leahy of Vermont, who has served since 1975. Having served for 7009126766080000000♠ 40&#160;years, 62&#160;days, Hatch is the longest-serving Republican Senator in U.S. history. Hatch served as either the chairman or ranking minority member of the Senate Judiciary Committee from 1993 to 2005. He previously served as chairman of the Health, Education, Labor and Pensions Committee from 1981 to 1987 and currently serves as Chairman of the Senate Finance Committee as well as serving on the Board of Directors for the United States Holocaust Memorial Museum. After the Republicans won control of the Senate during the 2014 midterms, Hatch became president pro tempore on January 6, 2015, after the 114th United States Congress was sworn in.", "id": "H000338"}, {"url": "/wiki/Mike_Lee_(U.S._politician)", "last_name": "Lee", "name": "Mike Lee", "biography": "Michael Shumway \" Mike \" Lee (born June 4, 1971) is an American politician and lawyer who is the junior United States Senator from Utah. A member of the Republican Party, Lee has served in the U.S. Senate since January 3, 2011. Born in Mesa, Arizona, Lee is a graduate of Brigham Young University. Lee began his career as a clerk for the U.S. District Court for the District of Utah before serving as a clerk for future Supreme Court Justice Samuel Alito, who was then a judge on the Third Circuit Court of Appeals. He then entered private practice with the Sidley Austin law firm in Washington D.C. In 2002, Lee returned to his home state to work as an Assistant U.S. Attorney for the District of Utah, a position he held until 2005. Subsequently, he joined the administration of Utah Governor Jon Huntsman, serving as the general counsel in the office of the governor from 2005 to 2006. Lee then reentered private practice in Washington D.C., with Howrey LLP. In 2010, at the beginning of the Tea Party movement, Lee posed a primary challenge to incumbent three term Republican Senator Bob Bennett. Lee went on to defeat Bennett and business owner Tim Bridgewater during the nominating process at Utah Republican Party Convention. He then defeated Democratic candidate Sam Granato in the general election with 61% of the vote to Granato's 32%. Lee is the son of Rex E. Lee, Solicitor General under President Reagan and founding Dean of J. Reuben Clark Law School at Brigham Young University. Lee endorsed fellow Republican Ted Cruz for President of the United States in the 2016 election.", "id": "L000577"}, {"url": "/wiki/Patrick_Leahy", "last_name": "Leahy", "name": "Patrick Leahy", "biography": "Patrick Joseph \" Pat \" Leahy (born March 31, 1940) is an American politician and the senior United States Senator from Vermont. He has been in office since 1975. A member of the Democratic Party, Leahy served as the President pro tempore of the United States Senate from December 17, 2012, to January 6, 2015. As President pro tempore, he was third in the presidential line of succession. He is the most senior senator and took office at a younger age than any other current senator. Leahy received the title of President pro tempore emeritus upon the commencement of the 114th Congress. He is the last remaining member of the Senate to have served during the presidency of Gerald Ford and prior to the 1976 election of President Jimmy Carter. Leahy is currently the longest-serving Democratic Senator as well as the longest-serving US Senator in the history of Vermont, and the current dean of his state's congressional delegation. Having been there since 1975, he is also the longest serving incumbent Senator following the death of Hawaii's Daniel Inouye, who had served from 1962 until his death in 2012. He is the former chairman of the Senate Judiciary Committee. The Senate Judiciary Committee worked extensively on prison reform with the introduction on a number of bills aimed at reforming the overcrowded prisons. The bills include: the Justice Safety Valve Act of 2013, The Smarter Sentencing Act of 2013, and the Public Safety Enhancement Act.", "id": "L000174"}, {"url": "/wiki/Bernie_Sanders", "last_name": "Sanders", "name": "Bernie Sanders", "biography": "This article is part of a series about Bernie Sanders", "id": "S000033"}, {"url": "/wiki/Mark_Warner", "last_name": "Warner", "name": "Mark Warner", "biography": "Mark Robert Warner (born December 15, 1954) is an American politician and the senior United States Senator from Virginia, in office since 2009. He is a member of the Democratic Party. Warner was the 69th Governor of Virginia, holding the office from 2002-06, and is the honorary chairman of the Forward Together PAC. Warner delivered the keynote address at the 2008 Democratic National Convention. Apart from politics, Warner is also known for his involvement in telecommunications-related venture capital during the 1980s; he founded the firm Columbia Capital. In 2006, he was widely expected to pursue the Democratic nomination in the 2008 U.S. presidential elections ; however, he announced in October 2006 that he would not run, citing a desire not to disrupt his family life. Warner was considered to be a potential vice presidential candidate, until he took himself out of consideration after receiving the Democratic nomination for the U.S. Senate. Contested by another former governor of Virginia, Jim Gilmore, Warner won the election with 65% of the vote. Warner won re-election to the seat in 2014, defeating former Republican National Committee Chairman Ed Gillespie, although his margin of only 17,000 votes was much narrower than expected.", "id": "W000805"}, {"url": "/wiki/Tim_Kaine", "last_name": "Kaine", "name": "Tim Kaine", "biography": "This article is part of a series about Tim Kaine", "id": "K000384"}, {"url": "/wiki/Patty_Murray", "last_name": "Murray", "name": "Patty Murray", "biography": "Patricia Lynn \" Patty \" Murray (née Johns ; October 11, 1950) is the senior United States Senator from the State of Washington and a member of the Democratic Party. Murray was first elected to the Senate in 1992, becoming Washington's first female senator. Murray was re-elected in 1998, 2004, 2010, and 2016. Murray has served as the Senate Majority Conference Secretary from 2007 until 2017, making her the fourth-highest-ranking Democrat and the highest-ranking woman in the Senate. In 2017 Murray became the Senate Assistant Minority Leader, making her the third-highest-ranking Democrat and still the highest-ranking woman in the Senate. Murray chaired the Democratic Senatorial Campaign Committee from 2001 to 2003 and again from 2011 to 2013. Murray chaired the Senate Budget Committee from 2013 to 2015. She also previously served as co-chair of the United States Congress Joint Select Committee on Deficit Reduction. Beginning in January 2015, Murray will be the Ranking Democratic Member on the Senate Committee on Health, Education, Labor and Pensions. She is currently the 9th most senior member of the United States Senate and the 3rd most senior Democrat. On December 10, 2013, Murray and Republican Representative Paul Ryan announced that they had negotiated a two-year, bipartisan budget, known as the Bipartisan Budget Act of 2013.", "id": "M001111"}, {"url": "/wiki/Maria_Cantwell", "last_name": "Cantwell", "name": "Maria Cantwell", "biography": "Maria Elaine Cantwell (born October 13, 1958) is the junior United States Senator from Washington, serving since 2001. A member of the Democratic Party, she previously served in the Washington House of Representatives from 1987 to 1993 and then in the United States House of Representatives from Washington's 1st congressional district from 1993 to 1995, after which she worked as an executive for RealNetworks. She is Washington's second female senator, after Patty Murray. She serves as the Ranking Member on the United States Senate Committee on Energy and Natural Resources. While Democrats were in the majority, Cantwell served as Chairwoman of the Committee on Small Business and Entrepreneurship from 2014 to 2015 and Chairwoman of the Committee on Indian Affairs from 2013 to 2014. Upon the February 2017 resignation of Jeff Sessions, Cantwell became the most senior junior Senator.", "id": "C000127"}, {"last_name": "Manchin", "name": "Joe Manchin", "url": "/wiki/Joe_Manchin", "id": "M001183", "biography": "Joseph \" Joe \" Manchin III (born August 24, 1947) is the senior United States Senator from West Virginia. Manchin, a member of the Democratic Party, served as the 34th Governor of West Virginia from 2005 to 2010 and the Secretary of State of West Virginia from 2001 to 2005. He won the special election in November 2010 to fill the seat of Senator Robert Byrd, the longest serving U.S. Senator in history, who died in office. Manchin was elected to a full term in office with 60 percent of the vote in November 2012. Manchin became the state's senior Senator when Jay Rockefeller retired in 2015. A centrist Democrat, Manchin is known for his bipartisanship, voting or working with Republicans on issues such as abortion and gun ownership."}, {"url": "/wiki/Shelley_Moore_Capito", "last_name": "Capito", "name": "Shelley Moore Capito", "biography": "Shelley Wellons Moore Capito (born November 26, 1953) is the junior United States Senator from West Virginia. She was a member of the United States House of Representatives for West Virginia's 2nd congressional district from 2001 until her election to the United States Senate in 2014. She is the current dean of West Virginia's congressional delegation. A graduate of Duke University and the University of Virginia, she is the daughter of the late Governor of West Virginia Arch Moore. Capito was the only Republican in the West Virginia congressional delegation until 2011 and the first Republican woman elected to Congress from West Virginia. Capito was elected to the Senate in 2014, becoming the first woman elected to the U.S. Senate in the history of West Virginia and the first Republican to win a full term in the Senate from West Virginia since 1942. She won mostly on large majorities in the counties along the Ohio, Pennsylvania, and Virginia borders. In Congress, Senator Capito has sponsored over 113 pieces of legislation, making her the most prolific federal legislator of the freshmen Senators elected in 2014. Senator Capito is Chairman of the Subcommittee on Clean Air and Nuclear Safety and Subcommittee on the Legislative Branch ; she is the only freshman Senator to chair a subcommittee on the powerful Appropriations Committee. She is a member of the Main Street Partnership, with three fellow Republican senators, focused on centrist goals in Congress. The group is the rough equivalent of the Blue Dog Democrats.", "id": "C001047"}, {"url": "/wiki/Ron_Johnson_(U.S._politician)", "last_name": "Johnson", "name": "Ron Johnson", "biography": "Ronald Harold \"Ron\" Johnson (born April 8, 1955) is the senior United States Senator for Wisconsin and a member of the Republican Party. Prior to his election to the Senate, he was chief executive officer of PACUR, LLC, a polyester and plastics manufacturer.", "id": "J000293"}, {"url": "/wiki/Tammy_Baldwin", "last_name": "Baldwin", "name": "Tammy Baldwin", "biography": "Tammy Suzanne Green Baldwin (born February 11, 1962) is the junior United States Senator from Wisconsin and a member of the Democratic Party. She previously served as the U.S. Representative from Wisconsin's 2nd congressional district from 1999 to 2013, as well as serving three terms in the Wisconsin Assembly representing the 78th district. Baldwin defeated her Republican opponent, former Wisconsin governor Tommy Thompson, in the 2012 U.S. Senate election. She is the first woman elected to represent Wisconsin in the Senate and the first openly gay U.S. Senator in history. As of 2012, Baldwin's voting record makes her one of the most liberal members of Congress.", "id": "B001230"}, {"url": "/wiki/Mike_Enzi", "last_name": "Enzi", "name": "Mike Enzi", "biography": "Michael Bradley \" Mike \" Enzi (born February 1, 1944) is an American politician who is the senior United States Senator from Wyoming, serving since 1997. He is a member of the Republican Party. Raised in Thermopolis, Wyoming, Enzi attended George Washington University and the University of Denver. He expanded his father's shoe store business in Gillette before being elected mayor of Gillette in 1974. In the late 1970s he worked in the United States Department of the Interior. He served as a state legislator in the Wyoming House of Representatives from 1987 to 1991 and the Wyoming Senate from 1991 to 1997. During the 1980s and 1990s he worked as an accountant and executive director in the energy industry. Enzi won a tight primary for election to the U.S. Senate in 1996 and was re-elected by large margins in 2002 and 2008. Since his election, he has consistently been ranked as one of the most conservative members of the Senate. He is the Chairman of the Senate Budget Committee. He was a member of the 2009 Gang of Six which attempted to negotiate health care reform. On July 16, 2013, Enzi disclosed that he would seek a fourth term as senator in the 2014 election. He won his fourth term on November 4, 2014 securing 71% of the vote.", "id": "E000285"}, {"url": "/wiki/John_Barrasso", "name": "John Barrasso"}]